h7ga40/azure_iot_hub/asp3_dcre/arch/rx630_gcc/rx630.h
/*
 *  TOPPERS/ASP Kernel
 *      Toyohashi Open Platform for Embedded Real-Time Systems/
 *      Advanced Standard Profile Kernel
 * 
 *  Copyright (C) 2008-2010 by Witz Corporation, JAPAN
 *  Copyright (C) 2013      by Mitsuhiro Matsuura
 * 
 *  上記著作権者は，以下の(1)～(4)の条件を満たす場合に限り，本ソフトウェ
 *  ア（本ソフトウェアを改変したものを含む．以下同じ）を使用・複製・改
 *  変・再配布（以下，利用と呼ぶ）することを無償で許諾する．
 *  (1) 本ソフトウェアをソースコードの形で利用する場合には，上記の著作
 *      権表示，この利用条件および下記の無保証規定が，そのままの形でソー
 *      スコード中に含まれていること．
 *  (2) 本ソフトウェアを，ライブラリ形式など，他のソフトウェア開発に使
 *      用できる形で再配布する場合には，再配布に伴うドキュメント（利用
 *      者マニュアルなど）に，上記の著作権表示，この利用条件および下記
 *      の無保証規定を掲載すること．
 *  (3) 本ソフトウェアを，機器に組み込むなど，他のソフトウェア開発に使
 *      用できない形で再配布する場合には，次のいずれかの条件を満たすこ
 *      と．
 *    (a) 再配布に伴うドキュメント（利用者マニュアルなど）に，上記の著
 *        作権表示，この利用条件および下記の無保証規定を掲載すること．
 *    (b) 再配布の形態を，別に定める方法によって，TOPPERSプロジェクトに
 *        報告すること．
 *  (4) 本ソフトウェアの利用により直接的または間接的に生じるいかなる損
 *      害からも，上記著作権者およびTOPPERSプロジェクトを免責すること．
 *      また，本ソフトウェアのユーザまたはエンドユーザからのいかなる理
 *      由に基づく請求からも，上記著作権者およびTOPPERSプロジェクトを
 *      免責すること．
 * 
 *  本ソフトウェアは，無保証で提供されているものである．上記著作権者お
 *  よびTOPPERSプロジェクトは，本ソフトウェアに関して，特定の使用目的
 *  に対する適合性も含めて，いかなる保証も行わない．また，本ソフトウェ
 *  アの利用により直接的または間接的に生じたいかなる損害に関しても，そ
 *  の責任を負わない．
 * 
 *  @(#) $Id$
 */

/*
 *  RX630に依存する定義
 */
#ifndef TOPPERS_RX630_H
#define TOPPERS_RX630_H

#define __evenaccess

/*
 *  CPU例外ハンドラ番号の定義(固定ベクタテーブル)
 *
 *  番号の範囲は0 - 31
 */
#define INT_PRIVILEGED_INSTRUNCTION		20		/* 特権命令例外 */
#define INT_UNDEF_INSTRUNCTION			23		/* 未定義命令例外 */
#define INT_FLOATINGPOINT_INSTRUCTION	25		/* 浮動小数点例外 */
#define INT_NMI							30		/* ノンマスカブル割り込み */
#define INT_RESET						31		/* リセット */

/*
 *  割込み番号の定義(可変ベクタテーブル)
 */
#define INT_BUSERR			16
#define INT_FCU_FCUERR		21
#define INT_FCU_FRDYI		23
#define INT_ICU_SWINT		27
#define INT_CMT0_CMI		28
#define INT_CMT1_CMI		29
#define INT_CMT2_CMI		30
#define INT_CMT3_CMI		31
#define INT_ETH_EINT		32
#define INT_USB0_D0FIFO0	33
#define INT_USB0_D1FIFO0	34
#define INT_USB0_USBI0		35
#define INT_USB1_D0FIFO1	36
#define INT_USB1_D1FIFO1	37
#define INT_USB1_USBI1		38
#define INT_RSPI0_SPRI0		39
#define INT_RSPI0_SPTI0		40
#define INT_RSPI0_SPII0		41
#define INT_RSPI1_SPRI1		42
#define INT_RSPI1_SPTI1		43
#define INT_RSPI1_SPII1		44
#define INT_RSPI2_SPRI2		45
#define INT_RSPI2_SPTI2		46
#define INT_RSPI2_SPII2		47
#define INT_CAN0_RXF0		48
#define INT_CAN0_TXF0		49
#define INT_CAN0_RXM0		50
#define INT_CAN0_TXM0		51
#define INT_CAN1_RXF1		52
#define INT_CAN1_TXF1		53
#define INT_CAN1_RXM1		54
#define INT_CAN1_TXM1		55
#define INT_CAN2_RXF2		56
#define INT_CAN2_TXF2		57
#define INT_CAN2_RXM2		58
#define INT_CAN2_TXM2		59
#define INT_RTC_CUP			62
#define INT_IRQ0			64
#define INT_IRQ1			65
#define INT_IRQ2			66
#define INT_IRQ3			67
#define INT_IRQ4			68
#define INT_IRQ5			69
#define INT_IRQ6			70
#define INT_IRQ7			71
#define INT_IRQ8			72
#define INT_IRQ9			73
#define INT_IRQ10			74
#define INT_IRQ11			75
#define INT_IRQ12			76
#define INT_IRQ13			77
#define INT_IRQ14			78
#define INT_IRQ15			79
#define INT_USB_USBR0		90
#define INT_USB_USBR1		91
#define INT_RTC_ALM			92
#define INT_RTC_PRD			93
#define INT_AD0_ADI0		98
#define INT_S12AD_S12ADI0	102
#define INT_ICU_GROUP0		106
#define INT_ICU_GROUP1		107
#define INT_ICU_GROUP2		108
#define INT_ICU_GROUP3		109
#define INT_ICU_GROUP4		110
#define INT_ICU_GROUP5		111
#define INT_ICU_GROUP6		112
#define INT_ICU_GROUP12		114
#define INT_SCI12_SCIX0		122
#define INT_SCI12_SCIX1		123
#define INT_SCI12_SCIX2		124
#define INT_SCI12_SCIX3		125
#define INT_TPU0_TGI0A		126
#define INT_TPU0_TGI0B		127
#define INT_TPU0_TGI0C		128
#define INT_TPU0_TGI0D		129
#define INT_TPU1_TGI0A		130
#define INT_TPU1_TGI0B		131
#define INT_TPU2_TGI0A		132
#define INT_TPU2_TGI0B		133
#define INT_TPU3_TGI0A		134
#define INT_TPU3_TGI0B		135
#define INT_TPU3_TGI0C		136
#define INT_TPU3_TGI0D		137
#define INT_TPU4_TGI0A		138
#define INT_TPU4_TGI0B		139
#define INT_TPU5_TGI0A		140
#define INT_TPU5_TGI0B		141
#define INT_MTU0_TGIA0		142
#define INT_MTU0_TGIB0		143
#define INT_MTU0_TGIC0		144
#define INT_MTU0_TGID0		145
#define INT_MTU0_TCIE0		146
#define INT_MTU0_TCIF0		147
#define INT_MTU1_TGIA1		148
#define INT_MTU1_TGIB1		149
#define INT_MTU2_TGIA2		150
#define INT_MTU2_TGIB2		151
#define INT_MTU3_TGIA3		152
#define INT_MTU3_TGIB3		153
#define INT_MTU3_TGIC3		154
#define INT_MTU3_TGID3		155
#define INT_MTU4_TGIA4		156
#define INT_MTU4_TGIB4		157
#define INT_MTU4_TGIC4		158
#define INT_MTU4_TGID4		159
#define INT_MTU4_TCIV4		160
#define INT_MTU5_TGIU5		161
#define INT_MTU5_TGIV5		162
#define INT_MTU5_TGIW5		163
#define INT_MTU5_TGI11A		164
#define INT_MTU5_TGI11B		165
#define INT_POE_OEI1		166
#define INT_POE_OEI2		167
#define INT_TMR0_CMI0A		170
#define INT_TMR0_CMI0B		171
#define INT_TMR0_OV0I		172
#define INT_TMR1_CMI1A		173
#define INT_TMR1_CMI1B		174
#define INT_TMR1_OV1I		175
#define INT_TMR2_CMI2A		176
#define INT_TMR2_CMI2B		177
#define INT_TMR2_OV2I		178
#define INT_TMR3_CMI3A		179
#define INT_TMR3_CMI3B		180
#define INT_TMR3_OV3I		181
#define INT_RIIC0_EEI		182
#define INT_RIIC0_RXI		183
#define INT_RIIC0_TXI		184
#define INT_RIIC0_TEI		185
#define INT_RIIC1_EEI		186
#define INT_RIIC1_RXI		187
#define INT_RIIC1_TXI		188
#define INT_RIIC1_TEI		189
#define INT_RIIC2_EEI		190
#define INT_RIIC2_RXI		191
#define INT_RIIC2_TXI		192
#define INT_RIIC2_TEI		193
#define INT_RIIC3_EEI		194
#define INT_RIIC3_RXI		195
#define INT_RIIC3_TXI		196
#define INT_RIIC3_TEI		197
#define INT_DMAC_DMAC0I		198
#define INT_DMAC_DMAC1I		199
#define INT_DMAC_DMAC2I		200
#define INT_DMAC_DMAC3I		201
#define INT_SCI0_RXI		214
#define INT_SCI0_TXI		215
#define INT_SCI0_TEI		216
#define INT_SCI1_RXI		217
#define INT_SCI1_TXI		218
#define INT_SCI1_TEI		219
#define INT_SCI2_RXI		220
#define INT_SCI2_TXI		221
#define INT_SCI2_TEI		222
#define INT_SCI3_RXI		223
#define INT_SCI3_TXI		224
#define INT_SCI3_TEI		225
#define INT_SCI4_RXI		226
#define INT_SCI4_TXI		227
#define INT_SCI4_TEI		228
#define INT_SCI5_RXI		229
#define INT_SCI5_TXI		230
#define INT_SCI5_TEI		231
#define INT_SCI6_RXI		232
#define INT_SCI6_TXI		233
#define INT_SCI6_TEI		234
#define INT_SCI7_RXI		235
#define INT_SCI7_TXI		236
#define INT_SCI7_TEI		237
#define INT_SCI8_RXI		238
#define INT_SCI8_TXI		239
#define INT_SCI8_TEI		240
#define INT_SCI9_RXI		241
#define INT_SCI9_TXI		242
#define INT_SCI9_TEI		243
#define INT_SCI10_RXI		244
#define INT_SCI10_TXI		245
#define INT_SCI10_TEI		246
#define INT_SCI11_RXI		247
#define INT_SCI11_TXI		248
#define INT_SCI11_TEI		249
#define INT_SCI12_RXI		250
#define INT_SCI12_TXI		251
#define INT_SCI12_TEI		252
#define INT_IEB_IEBINT		253

