h7ga40/azure_iot_hub/asp3_dcre/arch/rx630_gcc/rx630.h
/*
 *  各モジュールのレジスタ及び設定ビット情報
 */

#define SYSTEM_SYSCR0_ADDR		( ( volatile uint16_t __evenaccess * )0x00080006 )

/*
 * モジュールストップコントロールレジスタA（MSTPCRA）
 */
#define SYSTEM_MSTPCRA_ADDR			( ( volatile uint32_t __evenaccess * )0x00080010 )
#define SYSTEM_MSTPCRA_MSTPA0_BIT	( 1UL << 0U )
#define SYSTEM_MSTPCRA_MSTPA1_BIT	( 1UL << 1U )
#define SYSTEM_MSTPCRA_MSTPA2_BIT	( 1UL << 2U )
#define SYSTEM_MSTPCRA_MSTPA3_BIT	( 1UL << 3U )
#define SYSTEM_MSTPCRA_MSTPA4_BIT	( 1UL << 4U )
#define SYSTEM_MSTPCRA_MSTPA5_BIT	( 1UL << 5U )
#define SYSTEM_MSTPCRA_MSTPA6_BIT	( 1UL << 6U )
#define SYSTEM_MSTPCRA_MSTPA7_BIT	( 1UL << 7U )
#define SYSTEM_MSTPCRA_MSTPA8_BIT	( 1UL << 8U )
#define SYSTEM_MSTPCRA_MSTPA9_BIT	( 1UL << 9U )
#define SYSTEM_MSTPCRA_MSTPA10_BIT	( 1UL << 10U )
#define SYSTEM_MSTPCRA_MSTPA11_BIT	( 1UL << 11U )
#define SYSTEM_MSTPCRA_MSTPA12_BIT	( 1UL << 12U )
#define SYSTEM_MSTPCRA_MSTPA13_BIT	( 1UL << 13U )
#define SYSTEM_MSTPCRA_MSTPA14_BIT	( 1UL << 14U )
#define SYSTEM_MSTPCRA_MSTPA15_BIT	( 1UL << 15U )
#define SYSTEM_MSTPCRA_MSTPA16_BIT	( 1UL << 16U )
#define SYSTEM_MSTPCRA_MSTPA17_BIT	( 1UL << 17U )
#define SYSTEM_MSTPCRA_MSTPA18_BIT	( 1UL << 18U )
#define SYSTEM_MSTPCRA_MSTPA19_BIT	( 1UL << 19U )
#define SYSTEM_MSTPCRA_MSTPA20_BIT	( 1UL << 20U )
#define SYSTEM_MSTPCRA_MSTPA21_BIT	( 1UL << 21U )
#define SYSTEM_MSTPCRA_MSTPA22_BIT	( 1UL << 22U )
#define SYSTEM_MSTPCRA_MSTPA23_BIT	( 1UL << 23U )
#define SYSTEM_MSTPCRA_MSTPA24_BIT	( 1UL << 24U )
#define SYSTEM_MSTPCRA_MSTPA25_BIT	( 1UL << 25U )
#define SYSTEM_MSTPCRA_MSTPA26_BIT	( 1UL << 26U )
#define SYSTEM_MSTPCRA_MSTPA27_BIT	( 1UL << 27U )
#define SYSTEM_MSTPCRA_MSTPA28_BIT	( 1UL << 28U )
#define SYSTEM_MSTPCRA_MSTPA29_BIT	( 1UL << 29U )
#define SYSTEM_MSTPCRA_MSTPA30_BIT	( 1UL << 30U )
#define SYSTEM_MSTPCRA_MSTPA31_BIT	( 1UL << 31U )
#define SYSTEM_MSTPCRA_ACSE_BIT		( 1UL << 31U)

/*
 * モジュールストップコントロールレジスタB（MSTPCRB）
 */
#define SYSTEM_MSTPCRB_ADDR			( ( volatile uint32_t __evenaccess * )0x00080014 )
#define SYSTEM_MSTPCRB_MSTPB0_BIT	( 1UL << 0U )
#define SYSTEM_MSTPCRB_MSTPB1_BIT	( 1UL << 1U )
#define SYSTEM_MSTPCRB_MSTPB2_BIT	( 1UL << 2U )
#define SYSTEM_MSTPCRB_MSTPB3_BIT	( 1UL << 3U )
#define SYSTEM_MSTPCRB_MSTPB4_BIT	( 1UL << 4U )
#define SYSTEM_MSTPCRB_MSTPB5_BIT	( 1UL << 5U )
#define SYSTEM_MSTPCRB_MSTPB6_BIT	( 1UL << 6U )
#define SYSTEM_MSTPCRB_MSTPB7_BIT	( 1UL << 7U )
#define SYSTEM_MSTPCRB_MSTPB8_BIT	( 1UL << 8U )
#define SYSTEM_MSTPCRB_MSTPB9_BIT	( 1UL << 9U )
#define SYSTEM_MSTPCRB_MSTPB10_BIT	( 1UL << 10U )
#define SYSTEM_MSTPCRB_MSTPB11_BIT	( 1UL << 11U )
#define SYSTEM_MSTPCRB_MSTPB12_BIT	( 1UL << 12U )
#define SYSTEM_MSTPCRB_MSTPB13_BIT	( 1UL << 13U )
#define SYSTEM_MSTPCRB_MSTPB14_BIT	( 1UL << 14U )
#define SYSTEM_MSTPCRB_MSTPB15_BIT	( 1UL << 15U )
#define SYSTEM_MSTPCRB_MSTPB16_BIT	( 1UL << 16U )
#define SYSTEM_MSTPCRB_MSTPB17_BIT	( 1UL << 17U )
#define SYSTEM_MSTPCRB_MSTPB18_BIT	( 1UL << 18U )
#define SYSTEM_MSTPCRB_MSTPB19_BIT	( 1UL << 19U )
#define SYSTEM_MSTPCRB_MSTPB20_BIT	( 1UL << 20U )
#define SYSTEM_MSTPCRB_MSTPB21_BIT	( 1UL << 21U )
#define SYSTEM_MSTPCRB_MSTPB22_BIT	( 1UL << 22U )
#define SYSTEM_MSTPCRB_MSTPB23_BIT	( 1UL << 23U )
#define SYSTEM_MSTPCRB_MSTPB24_BIT	( 1UL << 24U )
#define SYSTEM_MSTPCRB_MSTPB25_BIT	( 1UL << 25U )
#define SYSTEM_MSTPCRB_MSTPB26_BIT	( 1UL << 26U )
#define SYSTEM_MSTPCRB_MSTPB27_BIT	( 1UL << 27U )
#define SYSTEM_MSTPCRB_MSTPB28_BIT	( 1UL << 28U )
#define SYSTEM_MSTPCRB_MSTPB29_BIT	( 1UL << 29U )
#define SYSTEM_MSTPCRB_MSTPB30_BIT	( 1UL << 30U )
#define SYSTEM_MSTPCRB_MSTPB31_BIT	( 1UL << 31U )

/*
 * モジュールストップコントロールレジスタC（MSTPCRC）
 */
#define SYSTEM_MSTPCRC_ADDR			( ( volatile uint32_t __evenaccess * )0x00080018 )
#define SYSTEM_MSTPCRC_MSTPC0_BIT	( 1UL << 0U )
#define SYSTEM_MSTPCRC_MSTPC1_BIT	( 1UL << 1U )
#define SYSTEM_MSTPCRC_MSTPC2_BIT	( 1UL << 2U )
#define SYSTEM_MSTPCRC_MSTPC3_BIT	( 1UL << 3U )
#define SYSTEM_MSTPCRC_MSTPC4_BIT	( 1UL << 4U )
#define SYSTEM_MSTPCRC_MSTPC5_BIT	( 1UL << 5U )
#define SYSTEM_MSTPCRC_MSTPC6_BIT	( 1UL << 6U )
#define SYSTEM_MSTPCRC_MSTPC7_BIT	( 1UL << 7U )
#define SYSTEM_MSTPCRC_MSTPC8_BIT	( 1UL << 8U )
#define SYSTEM_MSTPCRC_MSTPC9_BIT	( 1UL << 9U )
#define SYSTEM_MSTPCRC_MSTPC10_BIT	( 1UL << 10U )
#define SYSTEM_MSTPCRC_MSTPC11_BIT	( 1UL << 11U )
#define SYSTEM_MSTPCRC_MSTPC12_BIT	( 1UL << 12U )
#define SYSTEM_MSTPCRC_MSTPC13_BIT	( 1UL << 13U )
#define SYSTEM_MSTPCRC_MSTPC14_BIT	( 1UL << 14U )
#define SYSTEM_MSTPCRC_MSTPC15_BIT	( 1UL << 15U )
#define SYSTEM_MSTPCRC_MSTPC16_BIT	( 1UL << 16U )
#define SYSTEM_MSTPCRC_MSTPC17_BIT	( 1UL << 17U )
#define SYSTEM_MSTPCRC_MSTPC18_BIT	( 1UL << 18U )
#define SYSTEM_MSTPCRC_MSTPC19_BIT	( 1UL << 19U )
#define SYSTEM_MSTPCRC_MSTPC20_BIT	( 1UL << 20U )
#define SYSTEM_MSTPCRC_MSTPC21_BIT	( 1UL << 21U )
#define SYSTEM_MSTPCRC_MSTPC22_BIT	( 1UL << 22U )
#define SYSTEM_MSTPCRC_MSTPC23_BIT	( 1UL << 23U )
#define SYSTEM_MSTPCRC_MSTPC24_BIT	( 1UL << 24U )
#define SYSTEM_MSTPCRC_MSTPC25_BIT	( 1UL << 25U )
#define SYSTEM_MSTPCRC_MSTPC26_BIT	( 1UL << 26U )
#define SYSTEM_MSTPCRC_MSTPC27_BIT	( 1UL << 27U )
#define SYSTEM_MSTPCRC_MSTPC28_BIT	( 1UL << 28U )
#define SYSTEM_MSTPCRC_MSTPC29_BIT	( 1UL << 29U )
#define SYSTEM_MSTPCRC_MSTPC30_BIT	( 1UL << 30U )
#define SYSTEM_MSTPCRC_MSTPC31_BIT	( 1UL << 31U )

/*
 * クロック発生回路
 */
#define SYSTEM_SCKCR_ADDR			( ( volatile uint32_t __evenaccess * )0x00080020 )
#define SYSTEM_SCKCR2_ADDR		( ( volatile uint16_t __evenaccess * )0x00080024 )
#define SYSTEM_SCKCR2_UCK_OFFSET	( 4U )
#define SYSTEM_SCKCR2_UCK_MASK		( 0xFU << SYSTEM_SCKCR2_UCK_OFFSET )
#define SYSTEM_SCKCR3_ADDR		( ( volatile uint16_t __evenaccess * )0x00080026 )
#define SYSTEM_SCKCR3_CKSEL_OFFSET	( 8U )
#define SYSTEM_SCKCR3_CKSEL_MASK	( 0x7U << SYSTEM_SCKCR3_CKSEL_OFFSET )
#define SYSTEM_PLLCR_ADDR		( ( volatile uint16_t __evenaccess * )0x00080028 )
#define SYSTEM_PLLCR_STC_OFFSET		( 8U )
#define SYSTEM_PLLCR_STC_MASK		( 0x3FU << SYSTEM_PLLCR_STC_OFFSET )
#define SYSTEM_PLLCR2_ADDR			( ( volatile uint8_t __evenaccess * )0x0008002A )
#define SYSTEM_PLLCR2_PLLEN			( 1UL << 0U )
#define SYSTEM_MOFCR_ADDR		( ( volatile uint8_t __evenaccess * )0x0008C293 )
#define SYSTEM_MOFCR_MOFXIN		( 1UL << 0U )
#define SYSTEM_MOSCCR_ADDR			( ( volatile uint8_t __evenaccess * )0x00080032 )
#define SYSTEM_MOSCCR_MOSTP			( 1UL << 0U )

