h7ga40/azure_iot_hub/asp3_dcre/arch/rx630_gcc/rx630.h
/*
 * プロテクトレジスタ
 */
#define SYSTEM_PRCR_ADDR		( ( volatile uint16_t __evenaccess * )0x000803FE )

/*
 * 割り込み要求レジスタ
 */
#define ICU_IR000_ADDR			( ( volatile uint8_t __evenaccess * )0x00087000 )
#define ICU_IR001_ADDR			( ( volatile uint8_t __evenaccess * )0x00087001 )
#define ICU_IR002_ADDR			( ( volatile uint8_t __evenaccess * )0x00087002 )
#define ICU_IR003_ADDR			( ( volatile uint8_t __evenaccess * )0x00087003 )
#define ICU_IR004_ADDR			( ( volatile uint8_t __evenaccess * )0x00087004 )
#define ICU_IR005_ADDR			( ( volatile uint8_t __evenaccess * )0x00087005 )
#define ICU_IR006_ADDR			( ( volatile uint8_t __evenaccess * )0x00087006 )
#define ICU_IR007_ADDR			( ( volatile uint8_t __evenaccess * )0x00087007 )
#define ICU_IR008_ADDR			( ( volatile uint8_t __evenaccess * )0x00087008 )
#define ICU_IR009_ADDR			( ( volatile uint8_t __evenaccess * )0x00087009 )
#define ICU_IR010_ADDR			( ( volatile uint8_t __evenaccess * )0x0008700A )
#define ICU_IR011_ADDR			( ( volatile uint8_t __evenaccess * )0x0008700B )
#define ICU_IR012_ADDR			( ( volatile uint8_t __evenaccess * )0x0008700C )
#define ICU_IR013_ADDR			( ( volatile uint8_t __evenaccess * )0x0008700D )
#define ICU_IR014_ADDR			( ( volatile uint8_t __evenaccess * )0x0008700E )
#define ICU_IR015_ADDR			( ( volatile uint8_t __evenaccess * )0x0008700F )
#define ICU_IR016_ADDR			( ( volatile uint8_t __evenaccess * )0x00087010 )
#define ICU_IR017_ADDR			( ( volatile uint8_t __evenaccess * )0x00087011 )
#define ICU_IR018_ADDR			( ( volatile uint8_t __evenaccess * )0x00087012 )
#define ICU_IR019_ADDR			( ( volatile uint8_t __evenaccess * )0x00087013 )
#define ICU_IR020_ADDR			( ( volatile uint8_t __evenaccess * )0x00087014 )
#define ICU_IR021_ADDR			( ( volatile uint8_t __evenaccess * )0x00087015 )
#define ICU_IR022_ADDR			( ( volatile uint8_t __evenaccess * )0x00087016 )
#define ICU_IR023_ADDR			( ( volatile uint8_t __evenaccess * )0x00087017 )
#define ICU_IR024_ADDR			( ( volatile uint8_t __evenaccess * )0x00087018 )
#define ICU_IR025_ADDR			( ( volatile uint8_t __evenaccess * )0x00087019 )
#define ICU_IR026_ADDR			( ( volatile uint8_t __evenaccess * )0x0008701A )
#define ICU_IR027_ADDR			( ( volatile uint8_t __evenaccess * )0x0008701B )
#define ICU_IR028_ADDR			( ( volatile uint8_t __evenaccess * )0x0008701C )
#define ICU_IR029_ADDR			( ( volatile uint8_t __evenaccess * )0x0008701D )
#define ICU_IR030_ADDR			( ( volatile uint8_t __evenaccess * )0x0008701E )
#define ICU_IR031_ADDR			( ( volatile uint8_t __evenaccess * )0x0008701F )
#define ICU_IR032_ADDR			( ( volatile uint8_t __evenaccess * )0x00087020 )
#define ICU_IR033_ADDR			( ( volatile uint8_t __evenaccess * )0x00087021 )
#define ICU_IR034_ADDR			( ( volatile uint8_t __evenaccess * )0x00087022 )
#define ICU_IR035_ADDR			( ( volatile uint8_t __evenaccess * )0x00087023 )
#define ICU_IR036_ADDR			( ( volatile uint8_t __evenaccess * )0x00087024 )
#define ICU_IR037_ADDR			( ( volatile uint8_t __evenaccess * )0x00087025 )
#define ICU_IR038_ADDR			( ( volatile uint8_t __evenaccess * )0x00087026 )
#define ICU_IR039_ADDR			( ( volatile uint8_t __evenaccess * )0x00087027 )
#define ICU_IR040_ADDR			( ( volatile uint8_t __evenaccess * )0x00087028 )
#define ICU_IR041_ADDR			( ( volatile uint8_t __evenaccess * )0x00087029 )
#define ICU_IR042_ADDR			( ( volatile uint8_t __evenaccess * )0x0008702A )
#define ICU_IR043_ADDR			( ( volatile uint8_t __evenaccess * )0x0008702B )
#define ICU_IR044_ADDR			( ( volatile uint8_t __evenaccess * )0x0008702C )
#define ICU_IR045_ADDR			( ( volatile uint8_t __evenaccess * )0x0008702D )
#define ICU_IR046_ADDR			( ( volatile uint8_t __evenaccess * )0x0008702E )
#define ICU_IR047_ADDR			( ( volatile uint8_t __evenaccess * )0x0008702F )
#define ICU_IR048_ADDR			( ( volatile uint8_t __evenaccess * )0x00087030 )
#define ICU_IR049_ADDR			( ( volatile uint8_t __evenaccess * )0x00087031 )
#define ICU_IR050_ADDR			( ( volatile uint8_t __evenaccess * )0x00087032 )
#define ICU_IR051_ADDR			( ( volatile uint8_t __evenaccess * )0x00087033 )
#define ICU_IR052_ADDR			( ( volatile uint8_t __evenaccess * )0x00087034 )
#define ICU_IR053_ADDR			( ( volatile uint8_t __evenaccess * )0x00087035 )
#define ICU_IR054_ADDR			( ( volatile uint8_t __evenaccess * )0x00087036 )
#define ICU_IR055_ADDR			( ( volatile uint8_t __evenaccess * )0x00087037 )
#define ICU_IR056_ADDR			( ( volatile uint8_t __evenaccess * )0x00087038 )
#define ICU_IR057_ADDR			( ( volatile uint8_t __evenaccess * )0x00087039 )
#define ICU_IR058_ADDR			( ( volatile uint8_t __evenaccess * )0x0008703A )
#define ICU_IR059_ADDR			( ( volatile uint8_t __evenaccess * )0x0008703B )
#define ICU_IR060_ADDR			( ( volatile uint8_t __evenaccess * )0x0008703C )
#define ICU_IR061_ADDR			( ( volatile uint8_t __evenaccess * )0x0008703D )
#define ICU_IR062_ADDR			( ( volatile uint8_t __evenaccess * )0x0008703E )
#define ICU_IR063_ADDR			( ( volatile uint8_t __evenaccess * )0x0008703F )
#define ICU_IR064_ADDR			( ( volatile uint8_t __evenaccess * )0x00087040 )
#define ICU_IR065_ADDR			( ( volatile uint8_t __evenaccess * )0x00087041 )
#define ICU_IR066_ADDR			( ( volatile uint8_t __evenaccess * )0x00087042 )
#define ICU_IR067_ADDR			( ( volatile uint8_t __evenaccess * )0x00087043 )
#define ICU_IR068_ADDR			( ( volatile uint8_t __evenaccess * )0x00087044 )
#define ICU_IR069_ADDR			( ( volatile uint8_t __evenaccess * )0x00087045 )
#define ICU_IR070_ADDR			( ( volatile uint8_t __evenaccess * )0x00087046 )
#define ICU_IR071_ADDR			( ( volatile uint8_t __evenaccess * )0x00087047 )
#define ICU_IR072_ADDR			( ( volatile uint8_t __evenaccess * )0x00087048 )
#define ICU_IR073_ADDR			( ( volatile uint8_t __evenaccess * )0x00087049 )
#define ICU_IR074_ADDR			( ( volatile uint8_t __evenaccess * )0x0008704A )
#define ICU_IR075_ADDR			( ( volatile uint8_t __evenaccess * )0x0008704B )
#define ICU_IR076_ADDR			( ( volatile uint8_t __evenaccess * )0x0008704C )
#define ICU_IR077_ADDR			( ( volatile uint8_t __evenaccess * )0x0008704D )
#define ICU_IR078_ADDR			( ( volatile uint8_t __evenaccess * )0x0008704E )
#define ICU_IR079_ADDR			( ( volatile uint8_t __evenaccess * )0x0008704F )
#define ICU_IR080_ADDR			( ( volatile uint8_t __evenaccess * )0x00087050 )
#define ICU_IR081_ADDR			( ( volatile uint8_t __evenaccess * )0x00087051 )
#define ICU_IR082_ADDR			( ( volatile uint8_t __evenaccess * )0x00087052 )
#define ICU_IR083_ADDR			( ( volatile uint8_t __evenaccess * )0x00087053 )
#define ICU_IR084_ADDR			( ( volatile uint8_t __evenaccess * )0x00087054 )
#define ICU_IR085_ADDR			( ( volatile uint8_t __evenaccess * )0x00087055 )
#define ICU_IR086_ADDR			( ( volatile uint8_t __evenaccess * )0x00087056 )
#define ICU_IR087_ADDR			( ( volatile uint8_t __evenaccess * )0x00087057 )
#define ICU_IR088_ADDR			( ( volatile uint8_t __evenaccess * )0x00087058 )
#define ICU_IR089_ADDR			( ( volatile uint8_t __evenaccess * )0x00087059 )
#define ICU_IR090_ADDR			( ( volatile uint8_t __evenaccess * )0x0008705A )
#define ICU_IR091_ADDR			( ( volatile uint8_t __evenaccess * )0x0008705B )
#define ICU_IR092_ADDR			( ( volatile uint8_t __evenaccess * )0x0008705C )
#define ICU_IR093_ADDR			( ( volatile uint8_t __evenaccess * )0x0008705D )
#define ICU_IR094_ADDR			( ( volatile uint8_t __evenaccess * )0x0008705E )
#define ICU_IR095_ADDR			( ( volatile uint8_t __evenaccess * )0x0008705F )
#define ICU_IR096_ADDR			( ( volatile uint8_t __evenaccess * )0x00087060 )
#define ICU_IR097_ADDR			( ( volatile uint8_t __evenaccess * )0x00087061 )
#define ICU_IR098_ADDR			( ( volatile uint8_t __evenaccess * )0x00087062 )
#define ICU_IR099_ADDR			( ( volatile uint8_t __evenaccess * )0x00087063 )
#define ICU_IR100_ADDR			( ( volatile uint8_t __evenaccess * )0x00087064 )
#define ICU_IR101_ADDR			( ( volatile uint8_t __evenaccess * )0x00087065 )
#define ICU_IR102_ADDR			( ( volatile uint8_t __evenaccess * )0x00087066 )
#define ICU_IR103_ADDR			( ( volatile uint8_t __evenaccess * )0x00087067 )
#define ICU_IR104_ADDR			( ( volatile uint8_t __evenaccess * )0x00087068 )
#define ICU_IR105_ADDR			( ( volatile uint8_t __evenaccess * )0x00087069 )
#define ICU_IR106_ADDR			( ( volatile uint8_t __evenaccess * )0x0008706A )
#define ICU_IR107_ADDR			( ( volatile uint8_t __evenaccess * )0x0008706B )
#define ICU_IR108_ADDR			( ( volatile uint8_t __evenaccess * )0x0008706C )
#define ICU_IR109_ADDR			( ( volatile uint8_t __evenaccess * )0x0008706D )
#define ICU_IR110_ADDR			( ( volatile uint8_t __evenaccess * )0x0008706E )
#define ICU_IR111_ADDR			( ( volatile uint8_t __evenaccess * )0x0008706F )
#define ICU_IR112_ADDR			( ( volatile uint8_t __evenaccess * )0x00087070 )
#define ICU_IR113_ADDR			( ( volatile uint8_t __evenaccess * )0x00087071 )
#define ICU_IR114_ADDR			( ( volatile uint8_t __evenaccess * )0x00087072 )
#define ICU_IR115_ADDR			( ( volatile uint8_t __evenaccess * )0x00087073 )
#define ICU_IR116_ADDR			( ( volatile uint8_t __evenaccess * )0x00087074 )
#define ICU_IR117_ADDR			( ( volatile uint8_t __evenaccess * )0x00087075 )
#define ICU_IR118_ADDR			( ( volatile uint8_t __evenaccess * )0x00087076 )
#define ICU_IR119_ADDR			( ( volatile uint8_t __evenaccess * )0x00087077 )
#define ICU_IR120_ADDR			( ( volatile uint8_t __evenaccess * )0x00087078 )
#define ICU_IR121_ADDR			( ( volatile uint8_t __evenaccess * )0x00087079 )
#define ICU_IR122_ADDR			( ( volatile uint8_t __evenaccess * )0x0008707A )
#define ICU_IR123_ADDR			( ( volatile uint8_t __evenaccess * )0x0008707B )
#define ICU_IR124_ADDR			( ( volatile uint8_t __evenaccess * )0x0008707C )
#define ICU_IR125_ADDR			( ( volatile uint8_t __evenaccess * )0x0008707D )
#define ICU_IR126_ADDR			( ( volatile uint8_t __evenaccess * )0x0008707E )
#define ICU_IR127_ADDR			( ( volatile uint8_t __evenaccess * )0x0008707F )
#define ICU_IR128_ADDR			( ( volatile uint8_t __evenaccess * )0x00087080 )
#define ICU_IR129_ADDR			( ( volatile uint8_t __evenaccess * )0x00087081 )
#define ICU_IR130_ADDR			( ( volatile uint8_t __evenaccess * )0x00087082 )
#define ICU_IR131_ADDR			( ( volatile uint8_t __evenaccess * )0x00087083 )
#define ICU_IR132_ADDR			( ( volatile uint8_t __evenaccess * )0x00087084 )
#define ICU_IR133_ADDR			( ( volatile uint8_t __evenaccess * )0x00087085 )
#define ICU_IR134_ADDR			( ( volatile uint8_t __evenaccess * )0x00087086 )
#define ICU_IR135_ADDR			( ( volatile uint8_t __evenaccess * )0x00087087 )
#define ICU_IR136_ADDR			( ( volatile uint8_t __evenaccess * )0x00087088 )
#define ICU_IR137_ADDR			( ( volatile uint8_t __evenaccess * )0x00087089 )
#define ICU_IR138_ADDR			( ( volatile uint8_t __evenaccess * )0x0008708A )
#define ICU_IR139_ADDR			( ( volatile uint8_t __evenaccess * )0x0008708B )
#define ICU_IR140_ADDR			( ( volatile uint8_t __evenaccess * )0x0008708C )
#define ICU_IR141_ADDR			( ( volatile uint8_t __evenaccess * )0x0008708D )
#define ICU_IR142_ADDR			( ( volatile uint8_t __evenaccess * )0x0008708E )
#define ICU_IR143_ADDR			( ( volatile uint8_t __evenaccess * )0x0008708F )
#define ICU_IR144_ADDR			( ( volatile uint8_t __evenaccess * )0x00087090 )
#define ICU_IR145_ADDR			( ( volatile uint8_t __evenaccess * )0x00087091 )
#define ICU_IR146_ADDR			( ( volatile uint8_t __evenaccess * )0x00087092 )
#define ICU_IR147_ADDR			( ( volatile uint8_t __evenaccess * )0x00087093 )
#define ICU_IR148_ADDR			( ( volatile uint8_t __evenaccess * )0x00087094 )
#define ICU_IR149_ADDR			( ( volatile uint8_t __evenaccess * )0x00087095 )
#define ICU_IR150_ADDR			( ( volatile uint8_t __evenaccess * )0x00087096 )
#define ICU_IR151_ADDR			( ( volatile uint8_t __evenaccess * )0x00087097 )
#define ICU_IR152_ADDR			( ( volatile uint8_t __evenaccess * )0x00087098 )
#define ICU_IR153_ADDR			( ( volatile uint8_t __evenaccess * )0x00087099 )
#define ICU_IR154_ADDR			( ( volatile uint8_t __evenaccess * )0x0008709A )
#define ICU_IR155_ADDR			( ( volatile uint8_t __evenaccess * )0x0008709B )
#define ICU_IR156_ADDR			( ( volatile uint8_t __evenaccess * )0x0008709C )
#define ICU_IR157_ADDR			( ( volatile uint8_t __evenaccess * )0x0008709D )
#define ICU_IR158_ADDR			( ( volatile uint8_t __evenaccess * )0x0008709E )
#define ICU_IR159_ADDR			( ( volatile uint8_t __evenaccess * )0x0008709F )
#define ICU_IR160_ADDR			( ( volatile uint8_t __evenaccess * )0x000870A0 )
#define ICU_IR161_ADDR			( ( volatile uint8_t __evenaccess * )0x000870A1 )
#define ICU_IR162_ADDR			( ( volatile uint8_t __evenaccess * )0x000870A2 )
#define ICU_IR163_ADDR			( ( volatile uint8_t __evenaccess * )0x000870A3 )
#define ICU_IR164_ADDR			( ( volatile uint8_t __evenaccess * )0x000870A4 )
#define ICU_IR165_ADDR			( ( volatile uint8_t __evenaccess * )0x000870A5 )
#define ICU_IR166_ADDR			( ( volatile uint8_t __evenaccess * )0x000870A6 )
#define ICU_IR167_ADDR			( ( volatile uint8_t __evenaccess * )0x000870A7 )
#define ICU_IR168_ADDR			( ( volatile uint8_t __evenaccess * )0x000870A8 )
#define ICU_IR169_ADDR			( ( volatile uint8_t __evenaccess * )0x000870A9 )
#define ICU_IR170_ADDR			( ( volatile uint8_t __evenaccess * )0x000870AA )
#define ICU_IR171_ADDR			( ( volatile uint8_t __evenaccess * )0x000870AB )
#define ICU_IR172_ADDR			( ( volatile uint8_t __evenaccess * )0x000870AC )
#define ICU_IR173_ADDR			( ( volatile uint8_t __evenaccess * )0x000870AD )
#define ICU_IR174_ADDR			( ( volatile uint8_t __evenaccess * )0x000870AE )
#define ICU_IR175_ADDR			( ( volatile uint8_t __evenaccess * )0x000870AF )
#define ICU_IR176_ADDR			( ( volatile uint8_t __evenaccess * )0x000870B0 )
#define ICU_IR177_ADDR			( ( volatile uint8_t __evenaccess * )0x000870B1 )
#define ICU_IR178_ADDR			( ( volatile uint8_t __evenaccess * )0x000870B2 )
#define ICU_IR179_ADDR			( ( volatile uint8_t __evenaccess * )0x000870B3 )
#define ICU_IR180_ADDR			( ( volatile uint8_t __evenaccess * )0x000870B4 )
#define ICU_IR181_ADDR			( ( volatile uint8_t __evenaccess * )0x000870B5 )
#define ICU_IR182_ADDR			( ( volatile uint8_t __evenaccess * )0x000870B6 )
#define ICU_IR183_ADDR			( ( volatile uint8_t __evenaccess * )0x000870B7 )
#define ICU_IR184_ADDR			( ( volatile uint8_t __evenaccess * )0x000870B8 )
#define ICU_IR185_ADDR			( ( volatile uint8_t __evenaccess * )0x000870B9 )
#define ICU_IR186_ADDR			( ( volatile uint8_t __evenaccess * )0x000870BA )
#define ICU_IR187_ADDR			( ( volatile uint8_t __evenaccess * )0x000870BB )
#define ICU_IR188_ADDR			( ( volatile uint8_t __evenaccess * )0x000870BC )
#define ICU_IR189_ADDR			( ( volatile uint8_t __evenaccess * )0x000870BD )
#define ICU_IR190_ADDR			( ( volatile uint8_t __evenaccess * )0x000870BE )
#define ICU_IR191_ADDR			( ( volatile uint8_t __evenaccess * )0x000870BF )
#define ICU_IR192_ADDR			( ( volatile uint8_t __evenaccess * )0x000870C0 )
#define ICU_IR193_ADDR			( ( volatile uint8_t __evenaccess * )0x000870C1 )
#define ICU_IR194_ADDR			( ( volatile uint8_t __evenaccess * )0x000870C2 )
#define ICU_IR195_ADDR			( ( volatile uint8_t __evenaccess * )0x000870C3 )
#define ICU_IR196_ADDR			( ( volatile uint8_t __evenaccess * )0x000870C4 )
#define ICU_IR197_ADDR			( ( volatile uint8_t __evenaccess * )0x000870C5 )
#define ICU_IR198_ADDR			( ( volatile uint8_t __evenaccess * )0x000870C6 )
#define ICU_IR199_ADDR			( ( volatile uint8_t __evenaccess * )0x000870C7 )
#define ICU_IR200_ADDR			( ( volatile uint8_t __evenaccess * )0x000870C8 )
#define ICU_IR201_ADDR			( ( volatile uint8_t __evenaccess * )0x000870C9 )
#define ICU_IR202_ADDR			( ( volatile uint8_t __evenaccess * )0x000870CA )
#define ICU_IR203_ADDR			( ( volatile uint8_t __evenaccess * )0x000870CB )
#define ICU_IR204_ADDR			( ( volatile uint8_t __evenaccess * )0x000870CC )
#define ICU_IR205_ADDR			( ( volatile uint8_t __evenaccess * )0x000870CD )
#define ICU_IR206_ADDR			( ( volatile uint8_t __evenaccess * )0x000870CE )
#define ICU_IR207_ADDR			( ( volatile uint8_t __evenaccess * )0x000870CF )
#define ICU_IR208_ADDR			( ( volatile uint8_t __evenaccess * )0x000870D0 )
#define ICU_IR209_ADDR			( ( volatile uint8_t __evenaccess * )0x000870D1 )
#define ICU_IR210_ADDR			( ( volatile uint8_t __evenaccess * )0x000870D2 )
#define ICU_IR211_ADDR			( ( volatile uint8_t __evenaccess * )0x000870D3 )
#define ICU_IR212_ADDR			( ( volatile uint8_t __evenaccess * )0x000870D4 )
#define ICU_IR213_ADDR			( ( volatile uint8_t __evenaccess * )0x000870D5 )
#define ICU_IR214_ADDR			( ( volatile uint8_t __evenaccess * )0x000870D6 )
#define ICU_IR215_ADDR			( ( volatile uint8_t __evenaccess * )0x000870D7 )
#define ICU_IR216_ADDR			( ( volatile uint8_t __evenaccess * )0x000870D8 )
#define ICU_IR217_ADDR			( ( volatile uint8_t __evenaccess * )0x000870D9 )
#define ICU_IR218_ADDR			( ( volatile uint8_t __evenaccess * )0x000870DA )
#define ICU_IR219_ADDR			( ( volatile uint8_t __evenaccess * )0x000870DB )
#define ICU_IR220_ADDR			( ( volatile uint8_t __evenaccess * )0x000870DC )
#define ICU_IR221_ADDR			( ( volatile uint8_t __evenaccess * )0x000870DD )
#define ICU_IR222_ADDR			( ( volatile uint8_t __evenaccess * )0x000870DE )
#define ICU_IR223_ADDR			( ( volatile uint8_t __evenaccess * )0x000870DF )
#define ICU_IR224_ADDR			( ( volatile uint8_t __evenaccess * )0x000870E0 )
#define ICU_IR225_ADDR			( ( volatile uint8_t __evenaccess * )0x000870E1 )
#define ICU_IR226_ADDR			( ( volatile uint8_t __evenaccess * )0x000870E2 )
#define ICU_IR227_ADDR			( ( volatile uint8_t __evenaccess * )0x000870E3 )
#define ICU_IR228_ADDR			( ( volatile uint8_t __evenaccess * )0x000870E4 )
#define ICU_IR229_ADDR			( ( volatile uint8_t __evenaccess * )0x000870E5 )
#define ICU_IR230_ADDR			( ( volatile uint8_t __evenaccess * )0x000870E6 )
#define ICU_IR231_ADDR			( ( volatile uint8_t __evenaccess * )0x000870E7 )
#define ICU_IR232_ADDR			( ( volatile uint8_t __evenaccess * )0x000870E8 )
#define ICU_IR233_ADDR			( ( volatile uint8_t __evenaccess * )0x000870E9 )
#define ICU_IR234_ADDR			( ( volatile uint8_t __evenaccess * )0x000870EA )
#define ICU_IR235_ADDR			( ( volatile uint8_t __evenaccess * )0x000870EB )
#define ICU_IR236_ADDR			( ( volatile uint8_t __evenaccess * )0x000870EC )
#define ICU_IR237_ADDR			( ( volatile uint8_t __evenaccess * )0x000870ED )
#define ICU_IR238_ADDR			( ( volatile uint8_t __evenaccess * )0x000870EE )
#define ICU_IR239_ADDR			( ( volatile uint8_t __evenaccess * )0x000870EF )
#define ICU_IR240_ADDR			( ( volatile uint8_t __evenaccess * )0x000870F0 )
#define ICU_IR241_ADDR			( ( volatile uint8_t __evenaccess * )0x000870F1 )
#define ICU_IR242_ADDR			( ( volatile uint8_t __evenaccess * )0x000870F2 )
#define ICU_IR243_ADDR			( ( volatile uint8_t __evenaccess * )0x000870F3 )
#define ICU_IR244_ADDR			( ( volatile uint8_t __evenaccess * )0x000870F4 )
#define ICU_IR245_ADDR			( ( volatile uint8_t __evenaccess * )0x000870F5 )
#define ICU_IR246_ADDR			( ( volatile uint8_t __evenaccess * )0x000870F6 )
#define ICU_IR247_ADDR			( ( volatile uint8_t __evenaccess * )0x000870F7 )
#define ICU_IR248_ADDR			( ( volatile uint8_t __evenaccess * )0x000870F8 )
#define ICU_IR249_ADDR			( ( volatile uint8_t __evenaccess * )0x000870F9 )
#define ICU_IR250_ADDR			( ( volatile uint8_t __evenaccess * )0x000870FA )
#define ICU_IR251_ADDR			( ( volatile uint8_t __evenaccess * )0x000870FB )
#define ICU_IR252_ADDR			( ( volatile uint8_t __evenaccess * )0x000870FC )
#define ICU_IR253_ADDR			( ( volatile uint8_t __evenaccess * )0x000870FD )
#define ICU_IR254_ADDR			( ( volatile uint8_t __evenaccess * )0x000870FE )
#define ICU_IR255_ADDR			( ( volatile uint8_t __evenaccess * )0x000870FF )
#define ICU_IR_BIT				( 1U << 0U )

