h7ga40/azure_iot_hub/asp3_dcre/arch/rx630_gcc/rx630.h
/*
 * 割り込み要求先設定レジスタ
 */
#define ICU_ISELR000_ADDR		( ( volatile uint8_t __evenaccess * )0x00087100 )
#define ICU_ISELR001_ADDR		( ( volatile uint8_t __evenaccess * )0x00087101 )
#define ICU_ISELR002_ADDR		( ( volatile uint8_t __evenaccess * )0x00087102 )
#define ICU_ISELR003_ADDR		( ( volatile uint8_t __evenaccess * )0x00087103 )
#define ICU_ISELR004_ADDR		( ( volatile uint8_t __evenaccess * )0x00087104 )
#define ICU_ISELR005_ADDR		( ( volatile uint8_t __evenaccess * )0x00087105 )
#define ICU_ISELR006_ADDR		( ( volatile uint8_t __evenaccess * )0x00087106 )
#define ICU_ISELR007_ADDR		( ( volatile uint8_t __evenaccess * )0x00087107 )
#define ICU_ISELR008_ADDR		( ( volatile uint8_t __evenaccess * )0x00087108 )
#define ICU_ISELR009_ADDR		( ( volatile uint8_t __evenaccess * )0x00087109 )
#define ICU_ISELR010_ADDR		( ( volatile uint8_t __evenaccess * )0x0008710A )
#define ICU_ISELR011_ADDR		( ( volatile uint8_t __evenaccess * )0x0008710B )
#define ICU_ISELR012_ADDR		( ( volatile uint8_t __evenaccess * )0x0008710C )
#define ICU_ISELR013_ADDR		( ( volatile uint8_t __evenaccess * )0x0008710D )
#define ICU_ISELR014_ADDR		( ( volatile uint8_t __evenaccess * )0x0008710E )
#define ICU_ISELR015_ADDR		( ( volatile uint8_t __evenaccess * )0x0008710F )
#define ICU_ISELR016_ADDR		( ( volatile uint8_t __evenaccess * )0x00087110 )
#define ICU_ISELR017_ADDR		( ( volatile uint8_t __evenaccess * )0x00087111 )
#define ICU_ISELR018_ADDR		( ( volatile uint8_t __evenaccess * )0x00087112 )
#define ICU_ISELR019_ADDR		( ( volatile uint8_t __evenaccess * )0x00087113 )
#define ICU_ISELR020_ADDR		( ( volatile uint8_t __evenaccess * )0x00087114 )
#define ICU_ISELR021_ADDR		( ( volatile uint8_t __evenaccess * )0x00087115 )
#define ICU_ISELR022_ADDR		( ( volatile uint8_t __evenaccess * )0x00087116 )
#define ICU_ISELR023_ADDR		( ( volatile uint8_t __evenaccess * )0x00087117 )
#define ICU_ISELR024_ADDR		( ( volatile uint8_t __evenaccess * )0x00087118 )
#define ICU_ISELR025_ADDR		( ( volatile uint8_t __evenaccess * )0x00087119 )
#define ICU_ISELR026_ADDR		( ( volatile uint8_t __evenaccess * )0x0008711A )
#define ICU_ISELR027_ADDR		( ( volatile uint8_t __evenaccess * )0x0008711B )
#define ICU_ISELR028_ADDR		( ( volatile uint8_t __evenaccess * )0x0008711C )
#define ICU_ISELR029_ADDR		( ( volatile uint8_t __evenaccess * )0x0008711D )
#define ICU_ISELR030_ADDR		( ( volatile uint8_t __evenaccess * )0x0008711E )
#define ICU_ISELR031_ADDR		( ( volatile uint8_t __evenaccess * )0x0008711F )
#define ICU_ISELR032_ADDR		( ( volatile uint8_t __evenaccess * )0x00087120 )
#define ICU_ISELR033_ADDR		( ( volatile uint8_t __evenaccess * )0x00087121 )
#define ICU_ISELR034_ADDR		( ( volatile uint8_t __evenaccess * )0x00087122 )
#define ICU_ISELR035_ADDR		( ( volatile uint8_t __evenaccess * )0x00087123 )
#define ICU_ISELR036_ADDR		( ( volatile uint8_t __evenaccess * )0x00087124 )
#define ICU_ISELR037_ADDR		( ( volatile uint8_t __evenaccess * )0x00087125 )
#define ICU_ISELR038_ADDR		( ( volatile uint8_t __evenaccess * )0x00087126 )
#define ICU_ISELR039_ADDR		( ( volatile uint8_t __evenaccess * )0x00087127 )
#define ICU_ISELR040_ADDR		( ( volatile uint8_t __evenaccess * )0x00087128 )
#define ICU_ISELR041_ADDR		( ( volatile uint8_t __evenaccess * )0x00087129 )
#define ICU_ISELR042_ADDR		( ( volatile uint8_t __evenaccess * )0x0008712A )
#define ICU_ISELR043_ADDR		( ( volatile uint8_t __evenaccess * )0x0008712B )
#define ICU_ISELR044_ADDR		( ( volatile uint8_t __evenaccess * )0x0008712C )
#define ICU_ISELR045_ADDR		( ( volatile uint8_t __evenaccess * )0x0008712D )
#define ICU_ISELR046_ADDR		( ( volatile uint8_t __evenaccess * )0x0008712E )
#define ICU_ISELR047_ADDR		( ( volatile uint8_t __evenaccess * )0x0008712F )
#define ICU_ISELR048_ADDR		( ( volatile uint8_t __evenaccess * )0x00087130 )
#define ICU_ISELR049_ADDR		( ( volatile uint8_t __evenaccess * )0x00087131 )
#define ICU_ISELR050_ADDR		( ( volatile uint8_t __evenaccess * )0x00087132 )
#define ICU_ISELR051_ADDR		( ( volatile uint8_t __evenaccess * )0x00087133 )
#define ICU_ISELR052_ADDR		( ( volatile uint8_t __evenaccess * )0x00087134 )
#define ICU_ISELR053_ADDR		( ( volatile uint8_t __evenaccess * )0x00087135 )
#define ICU_ISELR054_ADDR		( ( volatile uint8_t __evenaccess * )0x00087136 )
#define ICU_ISELR055_ADDR		( ( volatile uint8_t __evenaccess * )0x00087137 )
#define ICU_ISELR056_ADDR		( ( volatile uint8_t __evenaccess * )0x00087138 )
#define ICU_ISELR057_ADDR		( ( volatile uint8_t __evenaccess * )0x00087139 )
#define ICU_ISELR058_ADDR		( ( volatile uint8_t __evenaccess * )0x0008713A )
#define ICU_ISELR059_ADDR		( ( volatile uint8_t __evenaccess * )0x0008713B )
#define ICU_ISELR060_ADDR		( ( volatile uint8_t __evenaccess * )0x0008713C )
#define ICU_ISELR061_ADDR		( ( volatile uint8_t __evenaccess * )0x0008713D )
#define ICU_ISELR062_ADDR		( ( volatile uint8_t __evenaccess * )0x0008713E )
#define ICU_ISELR063_ADDR		( ( volatile uint8_t __evenaccess * )0x0008713F )
#define ICU_ISELR064_ADDR		( ( volatile uint8_t __evenaccess * )0x00087140 )
#define ICU_ISELR065_ADDR		( ( volatile uint8_t __evenaccess * )0x00087141 )
#define ICU_ISELR066_ADDR		( ( volatile uint8_t __evenaccess * )0x00087142 )
#define ICU_ISELR067_ADDR		( ( volatile uint8_t __evenaccess * )0x00087143 )
#define ICU_ISELR068_ADDR		( ( volatile uint8_t __evenaccess * )0x00087144 )
#define ICU_ISELR069_ADDR		( ( volatile uint8_t __evenaccess * )0x00087145 )
#define ICU_ISELR070_ADDR		( ( volatile uint8_t __evenaccess * )0x00087146 )
#define ICU_ISELR071_ADDR		( ( volatile uint8_t __evenaccess * )0x00087147 )
#define ICU_ISELR072_ADDR		( ( volatile uint8_t __evenaccess * )0x00087148 )
#define ICU_ISELR073_ADDR		( ( volatile uint8_t __evenaccess * )0x00087149 )
#define ICU_ISELR074_ADDR		( ( volatile uint8_t __evenaccess * )0x0008714A )
#define ICU_ISELR075_ADDR		( ( volatile uint8_t __evenaccess * )0x0008714B )
#define ICU_ISELR076_ADDR		( ( volatile uint8_t __evenaccess * )0x0008714C )
#define ICU_ISELR077_ADDR		( ( volatile uint8_t __evenaccess * )0x0008714D )
#define ICU_ISELR078_ADDR		( ( volatile uint8_t __evenaccess * )0x0008714E )
#define ICU_ISELR079_ADDR		( ( volatile uint8_t __evenaccess * )0x0008714F )
#define ICU_ISELR080_ADDR		( ( volatile uint8_t __evenaccess * )0x00087150 )
#define ICU_ISELR081_ADDR		( ( volatile uint8_t __evenaccess * )0x00087151 )
#define ICU_ISELR082_ADDR		( ( volatile uint8_t __evenaccess * )0x00087152 )
#define ICU_ISELR083_ADDR		( ( volatile uint8_t __evenaccess * )0x00087153 )
#define ICU_ISELR084_ADDR		( ( volatile uint8_t __evenaccess * )0x00087154 )
#define ICU_ISELR085_ADDR		( ( volatile uint8_t __evenaccess * )0x00087155 )
#define ICU_ISELR086_ADDR		( ( volatile uint8_t __evenaccess * )0x00087156 )
#define ICU_ISELR087_ADDR		( ( volatile uint8_t __evenaccess * )0x00087157 )
#define ICU_ISELR088_ADDR		( ( volatile uint8_t __evenaccess * )0x00087158 )
#define ICU_ISELR089_ADDR		( ( volatile uint8_t __evenaccess * )0x00087159 )
#define ICU_ISELR090_ADDR		( ( volatile uint8_t __evenaccess * )0x0008715A )
#define ICU_ISELR091_ADDR		( ( volatile uint8_t __evenaccess * )0x0008715B )
#define ICU_ISELR092_ADDR		( ( volatile uint8_t __evenaccess * )0x0008715C )
#define ICU_ISELR093_ADDR		( ( volatile uint8_t __evenaccess * )0x0008715D )
#define ICU_ISELR094_ADDR		( ( volatile uint8_t __evenaccess * )0x0008715E )
#define ICU_ISELR095_ADDR		( ( volatile uint8_t __evenaccess * )0x0008715F )
#define ICU_ISELR096_ADDR		( ( volatile uint8_t __evenaccess * )0x00087160 )
#define ICU_ISELR097_ADDR		( ( volatile uint8_t __evenaccess * )0x00087161 )
#define ICU_ISELR098_ADDR		( ( volatile uint8_t __evenaccess * )0x00087162 )
#define ICU_ISELR099_ADDR		( ( volatile uint8_t __evenaccess * )0x00087163 )
#define ICU_ISELR100_ADDR		( ( volatile uint8_t __evenaccess * )0x00087164 )
#define ICU_ISELR101_ADDR		( ( volatile uint8_t __evenaccess * )0x00087165 )
#define ICU_ISELR102_ADDR		( ( volatile uint8_t __evenaccess * )0x00087166 )
#define ICU_ISELR103_ADDR		( ( volatile uint8_t __evenaccess * )0x00087167 )
#define ICU_ISELR104_ADDR		( ( volatile uint8_t __evenaccess * )0x00087168 )
#define ICU_ISELR105_ADDR		( ( volatile uint8_t __evenaccess * )0x00087169 )
#define ICU_ISELR106_ADDR		( ( volatile uint8_t __evenaccess * )0x0008716A )
#define ICU_ISELR107_ADDR		( ( volatile uint8_t __evenaccess * )0x0008716B )
#define ICU_ISELR108_ADDR		( ( volatile uint8_t __evenaccess * )0x0008716C )
#define ICU_ISELR109_ADDR		( ( volatile uint8_t __evenaccess * )0x0008716D )
#define ICU_ISELR110_ADDR		( ( volatile uint8_t __evenaccess * )0x0008716E )
#define ICU_ISELR111_ADDR		( ( volatile uint8_t __evenaccess * )0x0008716F )
#define ICU_ISELR112_ADDR		( ( volatile uint8_t __evenaccess * )0x00087170 )
#define ICU_ISELR113_ADDR		( ( volatile uint8_t __evenaccess * )0x00087171 )
#define ICU_ISELR114_ADDR		( ( volatile uint8_t __evenaccess * )0x00087172 )
#define ICU_ISELR115_ADDR		( ( volatile uint8_t __evenaccess * )0x00087173 )
#define ICU_ISELR116_ADDR		( ( volatile uint8_t __evenaccess * )0x00087174 )
#define ICU_ISELR117_ADDR		( ( volatile uint8_t __evenaccess * )0x00087175 )
#define ICU_ISELR118_ADDR		( ( volatile uint8_t __evenaccess * )0x00087176 )
#define ICU_ISELR119_ADDR		( ( volatile uint8_t __evenaccess * )0x00087177 )
#define ICU_ISELR120_ADDR		( ( volatile uint8_t __evenaccess * )0x00087178 )
#define ICU_ISELR121_ADDR		( ( volatile uint8_t __evenaccess * )0x00087179 )
#define ICU_ISELR122_ADDR		( ( volatile uint8_t __evenaccess * )0x0008717A )
#define ICU_ISELR123_ADDR		( ( volatile uint8_t __evenaccess * )0x0008717B )
#define ICU_ISELR124_ADDR		( ( volatile uint8_t __evenaccess * )0x0008717C )
#define ICU_ISELR125_ADDR		( ( volatile uint8_t __evenaccess * )0x0008717D )
#define ICU_ISELR126_ADDR		( ( volatile uint8_t __evenaccess * )0x0008717E )
#define ICU_ISELR127_ADDR		( ( volatile uint8_t __evenaccess * )0x0008717F )
#define ICU_ISELR128_ADDR		( ( volatile uint8_t __evenaccess * )0x00087180 )
#define ICU_ISELR129_ADDR		( ( volatile uint8_t __evenaccess * )0x00087181 )
#define ICU_ISELR130_ADDR		( ( volatile uint8_t __evenaccess * )0x00087182 )
#define ICU_ISELR131_ADDR		( ( volatile uint8_t __evenaccess * )0x00087183 )
#define ICU_ISELR132_ADDR		( ( volatile uint8_t __evenaccess * )0x00087184 )
#define ICU_ISELR133_ADDR		( ( volatile uint8_t __evenaccess * )0x00087185 )
#define ICU_ISELR134_ADDR		( ( volatile uint8_t __evenaccess * )0x00087186 )
#define ICU_ISELR135_ADDR		( ( volatile uint8_t __evenaccess * )0x00087187 )
#define ICU_ISELR136_ADDR		( ( volatile uint8_t __evenaccess * )0x00087188 )
#define ICU_ISELR137_ADDR		( ( volatile uint8_t __evenaccess * )0x00087189 )
#define ICU_ISELR138_ADDR		( ( volatile uint8_t __evenaccess * )0x0008718A )
#define ICU_ISELR139_ADDR		( ( volatile uint8_t __evenaccess * )0x0008718B )
#define ICU_ISELR140_ADDR		( ( volatile uint8_t __evenaccess * )0x0008718C )
#define ICU_ISELR141_ADDR		( ( volatile uint8_t __evenaccess * )0x0008718D )
#define ICU_ISELR142_ADDR		( ( volatile uint8_t __evenaccess * )0x0008718E )
#define ICU_ISELR143_ADDR		( ( volatile uint8_t __evenaccess * )0x0008718F )
#define ICU_ISELR144_ADDR		( ( volatile uint8_t __evenaccess * )0x00087190 )
#define ICU_ISELR145_ADDR		( ( volatile uint8_t __evenaccess * )0x00087191 )
#define ICU_ISELR146_ADDR		( ( volatile uint8_t __evenaccess * )0x00087192 )
#define ICU_ISELR147_ADDR		( ( volatile uint8_t __evenaccess * )0x00087193 )
#define ICU_ISELR148_ADDR		( ( volatile uint8_t __evenaccess * )0x00087194 )
#define ICU_ISELR149_ADDR		( ( volatile uint8_t __evenaccess * )0x00087195 )
#define ICU_ISELR150_ADDR		( ( volatile uint8_t __evenaccess * )0x00087196 )
#define ICU_ISELR151_ADDR		( ( volatile uint8_t __evenaccess * )0x00087197 )
#define ICU_ISELR152_ADDR		( ( volatile uint8_t __evenaccess * )0x00087198 )
#define ICU_ISELR153_ADDR		( ( volatile uint8_t __evenaccess * )0x00087199 )
#define ICU_ISELR154_ADDR		( ( volatile uint8_t __evenaccess * )0x0008719A )
#define ICU_ISELR155_ADDR		( ( volatile uint8_t __evenaccess * )0x0008719B )
#define ICU_ISELR156_ADDR		( ( volatile uint8_t __evenaccess * )0x0008719C )
#define ICU_ISELR157_ADDR		( ( volatile uint8_t __evenaccess * )0x0008719D )
#define ICU_ISELR158_ADDR		( ( volatile uint8_t __evenaccess * )0x0008719E )
#define ICU_ISELR159_ADDR		( ( volatile uint8_t __evenaccess * )0x0008719F )
#define ICU_ISELR160_ADDR		( ( volatile uint8_t __evenaccess * )0x000871A0 )
#define ICU_ISELR161_ADDR		( ( volatile uint8_t __evenaccess * )0x000871A1 )
#define ICU_ISELR162_ADDR		( ( volatile uint8_t __evenaccess * )0x000871A2 )
#define ICU_ISELR163_ADDR		( ( volatile uint8_t __evenaccess * )0x000871A3 )
#define ICU_ISELR164_ADDR		( ( volatile uint8_t __evenaccess * )0x000871A4 )
#define ICU_ISELR165_ADDR		( ( volatile uint8_t __evenaccess * )0x000871A5 )
#define ICU_ISELR166_ADDR		( ( volatile uint8_t __evenaccess * )0x000871A6 )
#define ICU_ISELR167_ADDR		( ( volatile uint8_t __evenaccess * )0x000871A7 )
#define ICU_ISELR168_ADDR		( ( volatile uint8_t __evenaccess * )0x000871A8 )
#define ICU_ISELR169_ADDR		( ( volatile uint8_t __evenaccess * )0x000871A9 )
#define ICU_ISELR170_ADDR		( ( volatile uint8_t __evenaccess * )0x000871AA )
#define ICU_ISELR171_ADDR		( ( volatile uint8_t __evenaccess * )0x000871AB )
#define ICU_ISELR172_ADDR		( ( volatile uint8_t __evenaccess * )0x000871AC )
#define ICU_ISELR173_ADDR		( ( volatile uint8_t __evenaccess * )0x000871AD )
#define ICU_ISELR174_ADDR		( ( volatile uint8_t __evenaccess * )0x000871AE )
#define ICU_ISELR175_ADDR		( ( volatile uint8_t __evenaccess * )0x000871AF )
#define ICU_ISELR176_ADDR		( ( volatile uint8_t __evenaccess * )0x000871B0 )
#define ICU_ISELR177_ADDR		( ( volatile uint8_t __evenaccess * )0x000871B1 )
#define ICU_ISELR178_ADDR		( ( volatile uint8_t __evenaccess * )0x000871B2 )
#define ICU_ISELR179_ADDR		( ( volatile uint8_t __evenaccess * )0x000871B3 )
#define ICU_ISELR180_ADDR		( ( volatile uint8_t __evenaccess * )0x000871B4 )
#define ICU_ISELR181_ADDR		( ( volatile uint8_t __evenaccess * )0x000871B5 )
#define ICU_ISELR182_ADDR		( ( volatile uint8_t __evenaccess * )0x000871B6 )
#define ICU_ISELR183_ADDR		( ( volatile uint8_t __evenaccess * )0x000871B7 )
#define ICU_ISELR184_ADDR		( ( volatile uint8_t __evenaccess * )0x000871B8 )
#define ICU_ISELR185_ADDR		( ( volatile uint8_t __evenaccess * )0x000871B9 )
#define ICU_ISELR186_ADDR		( ( volatile uint8_t __evenaccess * )0x000871BA )
#define ICU_ISELR187_ADDR		( ( volatile uint8_t __evenaccess * )0x000871BB )
#define ICU_ISELR188_ADDR		( ( volatile uint8_t __evenaccess * )0x000871BC )
#define ICU_ISELR189_ADDR		( ( volatile uint8_t __evenaccess * )0x000871BD )
#define ICU_ISELR190_ADDR		( ( volatile uint8_t __evenaccess * )0x000871BE )
#define ICU_ISELR191_ADDR		( ( volatile uint8_t __evenaccess * )0x000871BF )
#define ICU_ISELR192_ADDR		( ( volatile uint8_t __evenaccess * )0x000871C0 )
#define ICU_ISELR193_ADDR		( ( volatile uint8_t __evenaccess * )0x000871C1 )
#define ICU_ISELR194_ADDR		( ( volatile uint8_t __evenaccess * )0x000871C2 )
#define ICU_ISELR195_ADDR		( ( volatile uint8_t __evenaccess * )0x000871C3 )
#define ICU_ISELR196_ADDR		( ( volatile uint8_t __evenaccess * )0x000871C4 )
#define ICU_ISELR197_ADDR		( ( volatile uint8_t __evenaccess * )0x000871C5 )
#define ICU_ISELR198_ADDR		( ( volatile uint8_t __evenaccess * )0x000871C6 )
#define ICU_ISELR199_ADDR		( ( volatile uint8_t __evenaccess * )0x000871C7 )
#define ICU_ISELR200_ADDR		( ( volatile uint8_t __evenaccess * )0x000871C8 )
#define ICU_ISELR201_ADDR		( ( volatile uint8_t __evenaccess * )0x000871C9 )
#define ICU_ISELR202_ADDR		( ( volatile uint8_t __evenaccess * )0x000871CA )
#define ICU_ISELR203_ADDR		( ( volatile uint8_t __evenaccess * )0x000871CB )
#define ICU_ISELR204_ADDR		( ( volatile uint8_t __evenaccess * )0x000871CC )
#define ICU_ISELR205_ADDR		( ( volatile uint8_t __evenaccess * )0x000871CD )
#define ICU_ISELR206_ADDR		( ( volatile uint8_t __evenaccess * )0x000871CE )
#define ICU_ISELR207_ADDR		( ( volatile uint8_t __evenaccess * )0x000871CF )
#define ICU_ISELR208_ADDR		( ( volatile uint8_t __evenaccess * )0x000871D0 )
#define ICU_ISELR209_ADDR		( ( volatile uint8_t __evenaccess * )0x000871D1 )
#define ICU_ISELR210_ADDR		( ( volatile uint8_t __evenaccess * )0x000871D2 )
#define ICU_ISELR211_ADDR		( ( volatile uint8_t __evenaccess * )0x000871D3 )
#define ICU_ISELR212_ADDR		( ( volatile uint8_t __evenaccess * )0x000871D4 )
#define ICU_ISELR213_ADDR		( ( volatile uint8_t __evenaccess * )0x000871D5 )
#define ICU_ISELR214_ADDR		( ( volatile uint8_t __evenaccess * )0x000871D6 )
#define ICU_ISELR215_ADDR		( ( volatile uint8_t __evenaccess * )0x000871D7 )
#define ICU_ISELR216_ADDR		( ( volatile uint8_t __evenaccess * )0x000871D8 )
#define ICU_ISELR217_ADDR		( ( volatile uint8_t __evenaccess * )0x000871D9 )
#define ICU_ISELR218_ADDR		( ( volatile uint8_t __evenaccess * )0x000871DA )
#define ICU_ISELR219_ADDR		( ( volatile uint8_t __evenaccess * )0x000871DB )
#define ICU_ISELR220_ADDR		( ( volatile uint8_t __evenaccess * )0x000871DC )
#define ICU_ISELR221_ADDR		( ( volatile uint8_t __evenaccess * )0x000871DD )
#define ICU_ISELR222_ADDR		( ( volatile uint8_t __evenaccess * )0x000871DE )
#define ICU_ISELR223_ADDR		( ( volatile uint8_t __evenaccess * )0x000871DF )
#define ICU_ISELR224_ADDR		( ( volatile uint8_t __evenaccess * )0x000871E0 )
#define ICU_ISELR225_ADDR		( ( volatile uint8_t __evenaccess * )0x000871E1 )
#define ICU_ISELR226_ADDR		( ( volatile uint8_t __evenaccess * )0x000871E2 )
#define ICU_ISELR227_ADDR		( ( volatile uint8_t __evenaccess * )0x000871E3 )
#define ICU_ISELR228_ADDR		( ( volatile uint8_t __evenaccess * )0x000871E4 )
#define ICU_ISELR229_ADDR		( ( volatile uint8_t __evenaccess * )0x000871E5 )
#define ICU_ISELR230_ADDR		( ( volatile uint8_t __evenaccess * )0x000871E6 )
#define ICU_ISELR231_ADDR		( ( volatile uint8_t __evenaccess * )0x000871E7 )
#define ICU_ISELR232_ADDR		( ( volatile uint8_t __evenaccess * )0x000871E8 )
#define ICU_ISELR233_ADDR		( ( volatile uint8_t __evenaccess * )0x000871E9 )
#define ICU_ISELR234_ADDR		( ( volatile uint8_t __evenaccess * )0x000871EA )
#define ICU_ISELR235_ADDR		( ( volatile uint8_t __evenaccess * )0x000871EB )
#define ICU_ISELR236_ADDR		( ( volatile uint8_t __evenaccess * )0x000871EC )
#define ICU_ISELR237_ADDR		( ( volatile uint8_t __evenaccess * )0x000871ED )
#define ICU_ISELR238_ADDR		( ( volatile uint8_t __evenaccess * )0x000871EE )
#define ICU_ISELR239_ADDR		( ( volatile uint8_t __evenaccess * )0x000871EF )
#define ICU_ISELR240_ADDR		( ( volatile uint8_t __evenaccess * )0x000871F0 )
#define ICU_ISELR241_ADDR		( ( volatile uint8_t __evenaccess * )0x000871F1 )
#define ICU_ISELR242_ADDR		( ( volatile uint8_t __evenaccess * )0x000871F2 )
#define ICU_ISELR243_ADDR		( ( volatile uint8_t __evenaccess * )0x000871F3 )
#define ICU_ISELR244_ADDR		( ( volatile uint8_t __evenaccess * )0x000871F4 )
#define ICU_ISELR245_ADDR		( ( volatile uint8_t __evenaccess * )0x000871F5 )
#define ICU_ISELR246_ADDR		( ( volatile uint8_t __evenaccess * )0x000871F6 )
#define ICU_ISELR247_ADDR		( ( volatile uint8_t __evenaccess * )0x000871F7 )
#define ICU_ISELR248_ADDR		( ( volatile uint8_t __evenaccess * )0x000871F8 )
#define ICU_ISELR249_ADDR		( ( volatile uint8_t __evenaccess * )0x000871F9 )
#define ICU_ISELR250_ADDR		( ( volatile uint8_t __evenaccess * )0x000871FA )
#define ICU_ISELR251_ADDR		( ( volatile uint8_t __evenaccess * )0x000871FB )
#define ICU_ISELR252_ADDR		( ( volatile uint8_t __evenaccess * )0x000871FC )
#define ICU_ISELR253_ADDR		( ( volatile uint8_t __evenaccess * )0x000871FD )
#define ICU_ISELR254_ADDR		( ( volatile uint8_t __evenaccess * )0x000871FE )
#define ICU_ISELR255_ADDR		( ( volatile uint8_t __evenaccess * )0x000871FF )
#define ICU_ISEL_BIT			( 3U << 0U )

