h7ga40/azure_iot_hub/asp3_dcre/arch/rx630_gcc/rx630.h
/*
 * 割り込み要求許可レジスタ
 */
#define ICU_IER02_ADDR			( ( volatile uint8_t __evenaccess * )0x00087202 )
#define ICU_IER03_ADDR			( ( volatile uint8_t __evenaccess * )0x00087203 )
#define ICU_IER04_ADDR			( ( volatile uint8_t __evenaccess * )0x00087204 )
#define ICU_IER05_ADDR			( ( volatile uint8_t __evenaccess * )0x00087205 )
#define ICU_IER06_ADDR			( ( volatile uint8_t __evenaccess * )0x00087206 )
#define ICU_IER07_ADDR			( ( volatile uint8_t __evenaccess * )0x00087207 )
#define ICU_IER08_ADDR			( ( volatile uint8_t __evenaccess * )0x00087208 )
#define ICU_IER09_ADDR			( ( volatile uint8_t __evenaccess * )0x00087209 )
#define ICU_IER0B_ADDR			( ( volatile uint8_t __evenaccess * )0x0008720B )
#define ICU_IER0C_ADDR			( ( volatile uint8_t __evenaccess * )0x0008720C )
#define ICU_IER0D_ADDR			( ( volatile uint8_t __evenaccess * )0x0008720D )
#define ICU_IER0E_ADDR			( ( volatile uint8_t __evenaccess * )0x0008720E )
#define ICU_IER0F_ADDR			( ( volatile uint8_t __evenaccess * )0x0008720F )
#define ICU_IER10_ADDR			( ( volatile uint8_t __evenaccess * )0x00087210 )
#define ICU_IER11_ADDR			( ( volatile uint8_t __evenaccess * )0x00087211 )
#define ICU_IER12_ADDR			( ( volatile uint8_t __evenaccess * )0x00087212 )
#define ICU_IER13_ADDR			( ( volatile uint8_t __evenaccess * )0x00087213 )
#define ICU_IER14_ADDR			( ( volatile uint8_t __evenaccess * )0x00087214 )
#define ICU_IER15_ADDR			( ( volatile uint8_t __evenaccess * )0x00087215 )
#define ICU_IER16_ADDR			( ( volatile uint8_t __evenaccess * )0x00087216 )
#define ICU_IER17_ADDR			( ( volatile uint8_t __evenaccess * )0x00087217 )
#define ICU_IER18_ADDR			( ( volatile uint8_t __evenaccess * )0x00087218 )
#define ICU_IER19_ADDR			( ( volatile uint8_t __evenaccess * )0x00087219 )
#define ICU_IER1A_ADDR			( ( volatile uint8_t __evenaccess * )0x0008721A )
#define ICU_IER1B_ADDR			( ( volatile uint8_t __evenaccess * )0x0008721B )
#define ICU_IER1C_ADDR			( ( volatile uint8_t __evenaccess * )0x0008721C )
#define ICU_IER1D_ADDR			( ( volatile uint8_t __evenaccess * )0x0008721D )
#define ICU_IER1E_ADDR			( ( volatile uint8_t __evenaccess * )0x0008721E )
#define ICU_IER1F_ADDR			( ( volatile uint8_t __evenaccess * )0x0008721F )
#define ICU_IEN0_BIT			( 1U << 0U )
#define ICU_IEN1_BIT			( 1U << 1U )
#define ICU_IEN2_BIT			( 1U << 2U )
#define ICU_IEN3_BIT			( 1U << 3U )
#define ICU_IEN4_BIT			( 1U << 4U )
#define ICU_IEN5_BIT			( 1U << 5U )
#define ICU_IEN6_BIT			( 1U << 6U )
#define ICU_IEN7_BIT			( 1U << 7U )

/* 
 * 割り込み要因プライオリティレジスタi(i=0～253)の設定
 */
#define ICU_IPR000_ADDR			( ( volatile uint8_t __evenaccess * )0x00087300 )
#define ICU_IPR001_ADDR			( ( volatile uint8_t __evenaccess * )0x00087301 )
#define ICU_IPR002_ADDR			( ( volatile uint8_t __evenaccess * )0x00087302 )
#define ICU_IPR003_ADDR			( ( volatile uint8_t __evenaccess * )0x00087303 )
#define ICU_IPR004_ADDR			( ( volatile uint8_t __evenaccess * )0x00087304 )
#define ICU_IPR005_ADDR			( ( volatile uint8_t __evenaccess * )0x00087305 )
#define ICU_IPR006_ADDR			( ( volatile uint8_t __evenaccess * )0x00087306 )
#define ICU_IPR007_ADDR			( ( volatile uint8_t __evenaccess * )0x00087307 )
#define ICU_IPR008_ADDR			( ( volatile uint8_t __evenaccess * )0x00087308 )
#define ICU_IPR009_ADDR			( ( volatile uint8_t __evenaccess * )0x00087309 )
#define ICU_IPR010_ADDR			( ( volatile uint8_t __evenaccess * )0x0008730A )
#define ICU_IPR011_ADDR			( ( volatile uint8_t __evenaccess * )0x0008730B )
#define ICU_IPR012_ADDR			( ( volatile uint8_t __evenaccess * )0x0008730C )
#define ICU_IPR013_ADDR			( ( volatile uint8_t __evenaccess * )0x0008730D )
#define ICU_IPR014_ADDR			( ( volatile uint8_t __evenaccess * )0x0008730E )
#define ICU_IPR015_ADDR			( ( volatile uint8_t __evenaccess * )0x0008730F )
#define ICU_IPR016_ADDR			( ( volatile uint8_t __evenaccess * )0x00087310 )
#define ICU_IPR017_ADDR			( ( volatile uint8_t __evenaccess * )0x00087311 )
#define ICU_IPR018_ADDR			( ( volatile uint8_t __evenaccess * )0x00087312 )
#define ICU_IPR019_ADDR			( ( volatile uint8_t __evenaccess * )0x00087313 )
#define ICU_IPR020_ADDR			( ( volatile uint8_t __evenaccess * )0x00087314 )
#define ICU_IPR021_ADDR			( ( volatile uint8_t __evenaccess * )0x00087315 )
#define ICU_IPR022_ADDR			( ( volatile uint8_t __evenaccess * )0x00087316 )
#define ICU_IPR023_ADDR			( ( volatile uint8_t __evenaccess * )0x00087317 )
#define ICU_IPR024_ADDR			( ( volatile uint8_t __evenaccess * )0x00087318 )
#define ICU_IPR025_ADDR			( ( volatile uint8_t __evenaccess * )0x00087319 )
#define ICU_IPR026_ADDR			( ( volatile uint8_t __evenaccess * )0x0008731A )
#define ICU_IPR027_ADDR			( ( volatile uint8_t __evenaccess * )0x0008731B )
#define ICU_IPR028_ADDR			( ( volatile uint8_t __evenaccess * )0x0008731C )
#define ICU_IPR029_ADDR			( ( volatile uint8_t __evenaccess * )0x0008731D )
#define ICU_IPR030_ADDR			( ( volatile uint8_t __evenaccess * )0x0008731E )
#define ICU_IPR031_ADDR			( ( volatile uint8_t __evenaccess * )0x0008731F )
#define ICU_IPR032_ADDR			( ( volatile uint8_t __evenaccess * )0x00087320 )
#define ICU_IPR033_ADDR			( ( volatile uint8_t __evenaccess * )0x00087321 )
#define ICU_IPR034_ADDR			( ( volatile uint8_t __evenaccess * )0x00087322 )
#define ICU_IPR035_ADDR			( ( volatile uint8_t __evenaccess * )0x00087323 )
#define ICU_IPR036_ADDR			( ( volatile uint8_t __evenaccess * )0x00087324 )
#define ICU_IPR037_ADDR			( ( volatile uint8_t __evenaccess * )0x00087325 )
#define ICU_IPR038_ADDR			( ( volatile uint8_t __evenaccess * )0x00087326 )
#define ICU_IPR039_ADDR			( ( volatile uint8_t __evenaccess * )0x00087327 )
#define ICU_IPR040_ADDR			( ( volatile uint8_t __evenaccess * )0x00087328 )
#define ICU_IPR041_ADDR			( ( volatile uint8_t __evenaccess * )0x00087329 )
#define ICU_IPR042_ADDR			( ( volatile uint8_t __evenaccess * )0x0008732A )
#define ICU_IPR043_ADDR			( ( volatile uint8_t __evenaccess * )0x0008732B )
#define ICU_IPR044_ADDR			( ( volatile uint8_t __evenaccess * )0x0008732C )
#define ICU_IPR045_ADDR			( ( volatile uint8_t __evenaccess * )0x0008732D )
#define ICU_IPR046_ADDR			( ( volatile uint8_t __evenaccess * )0x0008732E )
#define ICU_IPR047_ADDR			( ( volatile uint8_t __evenaccess * )0x0008732F )
#define ICU_IPR048_ADDR			( ( volatile uint8_t __evenaccess * )0x00087330 )
#define ICU_IPR049_ADDR			( ( volatile uint8_t __evenaccess * )0x00087331 )
#define ICU_IPR050_ADDR			( ( volatile uint8_t __evenaccess * )0x00087332 )
#define ICU_IPR051_ADDR			( ( volatile uint8_t __evenaccess * )0x00087333 )
#define ICU_IPR052_ADDR			( ( volatile uint8_t __evenaccess * )0x00087334 )
#define ICU_IPR053_ADDR			( ( volatile uint8_t __evenaccess * )0x00087335 )
#define ICU_IPR054_ADDR			( ( volatile uint8_t __evenaccess * )0x00087336 )
#define ICU_IPR055_ADDR			( ( volatile uint8_t __evenaccess * )0x00087337 )
#define ICU_IPR056_ADDR			( ( volatile uint8_t __evenaccess * )0x00087338 )
#define ICU_IPR057_ADDR			( ( volatile uint8_t __evenaccess * )0x00087339 )
#define ICU_IPR058_ADDR			( ( volatile uint8_t __evenaccess * )0x0008733A )
#define ICU_IPR059_ADDR			( ( volatile uint8_t __evenaccess * )0x0008733B )
#define ICU_IPR060_ADDR			( ( volatile uint8_t __evenaccess * )0x0008733C )
#define ICU_IPR061_ADDR			( ( volatile uint8_t __evenaccess * )0x0008733D )
#define ICU_IPR062_ADDR			( ( volatile uint8_t __evenaccess * )0x0008733E )
#define ICU_IPR063_ADDR			( ( volatile uint8_t __evenaccess * )0x0008733F )
#define ICU_IPR064_ADDR			( ( volatile uint8_t __evenaccess * )0x00087340 )
#define ICU_IPR065_ADDR			( ( volatile uint8_t __evenaccess * )0x00087341 )
#define ICU_IPR066_ADDR			( ( volatile uint8_t __evenaccess * )0x00087342 )
#define ICU_IPR067_ADDR			( ( volatile uint8_t __evenaccess * )0x00087343 )
#define ICU_IPR068_ADDR			( ( volatile uint8_t __evenaccess * )0x00087344 )
#define ICU_IPR069_ADDR			( ( volatile uint8_t __evenaccess * )0x00087345 )
#define ICU_IPR070_ADDR			( ( volatile uint8_t __evenaccess * )0x00087346 )
#define ICU_IPR071_ADDR			( ( volatile uint8_t __evenaccess * )0x00087347 )
#define ICU_IPR072_ADDR			( ( volatile uint8_t __evenaccess * )0x00087348 )
#define ICU_IPR073_ADDR			( ( volatile uint8_t __evenaccess * )0x00087349 )
#define ICU_IPR074_ADDR			( ( volatile uint8_t __evenaccess * )0x0008734A )
#define ICU_IPR075_ADDR			( ( volatile uint8_t __evenaccess * )0x0008734B )
#define ICU_IPR076_ADDR			( ( volatile uint8_t __evenaccess * )0x0008734C )
#define ICU_IPR077_ADDR			( ( volatile uint8_t __evenaccess * )0x0008734D )
#define ICU_IPR078_ADDR			( ( volatile uint8_t __evenaccess * )0x0008734E )
#define ICU_IPR079_ADDR			( ( volatile uint8_t __evenaccess * )0x0008734F )
#define ICU_IPR080_ADDR			( ( volatile uint8_t __evenaccess * )0x00087350 )
#define ICU_IPR081_ADDR			( ( volatile uint8_t __evenaccess * )0x00087351 )
#define ICU_IPR082_ADDR			( ( volatile uint8_t __evenaccess * )0x00087352 )
#define ICU_IPR083_ADDR			( ( volatile uint8_t __evenaccess * )0x00087353 )
#define ICU_IPR084_ADDR			( ( volatile uint8_t __evenaccess * )0x00087354 )
#define ICU_IPR085_ADDR			( ( volatile uint8_t __evenaccess * )0x00087355 )
#define ICU_IPR086_ADDR			( ( volatile uint8_t __evenaccess * )0x00087356 )
#define ICU_IPR087_ADDR			( ( volatile uint8_t __evenaccess * )0x00087357 )
#define ICU_IPR088_ADDR			( ( volatile uint8_t __evenaccess * )0x00087358 )
#define ICU_IPR089_ADDR			( ( volatile uint8_t __evenaccess * )0x00087359 )
#define ICU_IPR090_ADDR			( ( volatile uint8_t __evenaccess * )0x0008735A )
#define ICU_IPR091_ADDR			( ( volatile uint8_t __evenaccess * )0x0008735B )
#define ICU_IPR092_ADDR			( ( volatile uint8_t __evenaccess * )0x0008735C )
#define ICU_IPR093_ADDR			( ( volatile uint8_t __evenaccess * )0x0008735D )
#define ICU_IPR094_ADDR			( ( volatile uint8_t __evenaccess * )0x0008735E )
#define ICU_IPR095_ADDR			( ( volatile uint8_t __evenaccess * )0x0008735F )
#define ICU_IPR096_ADDR			( ( volatile uint8_t __evenaccess * )0x00087360 )
#define ICU_IPR097_ADDR			( ( volatile uint8_t __evenaccess * )0x00087361 )
#define ICU_IPR098_ADDR			( ( volatile uint8_t __evenaccess * )0x00087362 )
#define ICU_IPR099_ADDR			( ( volatile uint8_t __evenaccess * )0x00087363 )
#define ICU_IPR100_ADDR			( ( volatile uint8_t __evenaccess * )0x00087364 )
#define ICU_IPR101_ADDR			( ( volatile uint8_t __evenaccess * )0x00087365 )
#define ICU_IPR102_ADDR			( ( volatile uint8_t __evenaccess * )0x00087366 )
#define ICU_IPR103_ADDR			( ( volatile uint8_t __evenaccess * )0x00087367 )
#define ICU_IPR104_ADDR			( ( volatile uint8_t __evenaccess * )0x00087368 )
#define ICU_IPR105_ADDR			( ( volatile uint8_t __evenaccess * )0x00087369 )
#define ICU_IPR106_ADDR			( ( volatile uint8_t __evenaccess * )0x0008736A )
#define ICU_IPR107_ADDR			( ( volatile uint8_t __evenaccess * )0x0008736B )
#define ICU_IPR108_ADDR			( ( volatile uint8_t __evenaccess * )0x0008736C )
#define ICU_IPR109_ADDR			( ( volatile uint8_t __evenaccess * )0x0008736D )
#define ICU_IPR110_ADDR			( ( volatile uint8_t __evenaccess * )0x0008736E )
#define ICU_IPR111_ADDR			( ( volatile uint8_t __evenaccess * )0x0008736F )
#define ICU_IPR112_ADDR			( ( volatile uint8_t __evenaccess * )0x00087370 )
#define ICU_IPR113_ADDR			( ( volatile uint8_t __evenaccess * )0x00087371 )
#define ICU_IPR114_ADDR			( ( volatile uint8_t __evenaccess * )0x00087372 )
#define ICU_IPR115_ADDR			( ( volatile uint8_t __evenaccess * )0x00087373 )
#define ICU_IPR116_ADDR			( ( volatile uint8_t __evenaccess * )0x00087374 )
#define ICU_IPR117_ADDR			( ( volatile uint8_t __evenaccess * )0x00087375 )
#define ICU_IPR118_ADDR			( ( volatile uint8_t __evenaccess * )0x00087376 )
#define ICU_IPR119_ADDR			( ( volatile uint8_t __evenaccess * )0x00087377 )
#define ICU_IPR120_ADDR			( ( volatile uint8_t __evenaccess * )0x00087378 )
#define ICU_IPR121_ADDR			( ( volatile uint8_t __evenaccess * )0x00087379 )
#define ICU_IPR122_ADDR			( ( volatile uint8_t __evenaccess * )0x0008737A )
#define ICU_IPR123_ADDR			( ( volatile uint8_t __evenaccess * )0x0008737B )
#define ICU_IPR124_ADDR			( ( volatile uint8_t __evenaccess * )0x0008737C )
#define ICU_IPR125_ADDR			( ( volatile uint8_t __evenaccess * )0x0008737D )
#define ICU_IPR126_ADDR			( ( volatile uint8_t __evenaccess * )0x0008737E )
#define ICU_IPR127_ADDR			( ( volatile uint8_t __evenaccess * )0x0008737F )
#define ICU_IPR128_ADDR			( ( volatile uint8_t __evenaccess * )0x00087380 )
#define ICU_IPR129_ADDR			( ( volatile uint8_t __evenaccess * )0x00087381 )
#define ICU_IPR130_ADDR			( ( volatile uint8_t __evenaccess * )0x00087382 )
#define ICU_IPR131_ADDR			( ( volatile uint8_t __evenaccess * )0x00087383 )
#define ICU_IPR132_ADDR			( ( volatile uint8_t __evenaccess * )0x00087384 )
#define ICU_IPR133_ADDR			( ( volatile uint8_t __evenaccess * )0x00087385 )
#define ICU_IPR134_ADDR			( ( volatile uint8_t __evenaccess * )0x00087386 )
#define ICU_IPR135_ADDR			( ( volatile uint8_t __evenaccess * )0x00087387 )
#define ICU_IPR136_ADDR			( ( volatile uint8_t __evenaccess * )0x00087388 )
#define ICU_IPR137_ADDR			( ( volatile uint8_t __evenaccess * )0x00087389 )
#define ICU_IPR138_ADDR			( ( volatile uint8_t __evenaccess * )0x0008738A )
#define ICU_IPR139_ADDR			( ( volatile uint8_t __evenaccess * )0x0008738B )
#define ICU_IPR140_ADDR			( ( volatile uint8_t __evenaccess * )0x0008738C )
#define ICU_IPR141_ADDR			( ( volatile uint8_t __evenaccess * )0x0008738D )
#define ICU_IPR142_ADDR			( ( volatile uint8_t __evenaccess * )0x0008738E )
#define ICU_IPR143_ADDR			( ( volatile uint8_t __evenaccess * )0x0008738F )
#define ICU_IPR144_ADDR			( ( volatile uint8_t __evenaccess * )0x00087390 )
#define ICU_IPR145_ADDR			( ( volatile uint8_t __evenaccess * )0x00087391 )
#define ICU_IPR146_ADDR			( ( volatile uint8_t __evenaccess * )0x00087392 )
#define ICU_IPR147_ADDR			( ( volatile uint8_t __evenaccess * )0x00087393 )
#define ICU_IPR148_ADDR			( ( volatile uint8_t __evenaccess * )0x00087394 )
#define ICU_IPR149_ADDR			( ( volatile uint8_t __evenaccess * )0x00087395 )
#define ICU_IPR150_ADDR			( ( volatile uint8_t __evenaccess * )0x00087396 )
#define ICU_IPR151_ADDR			( ( volatile uint8_t __evenaccess * )0x00087397 )
#define ICU_IPR152_ADDR			( ( volatile uint8_t __evenaccess * )0x00087398 )
#define ICU_IPR153_ADDR			( ( volatile uint8_t __evenaccess * )0x00087399 )
#define ICU_IPR154_ADDR			( ( volatile uint8_t __evenaccess * )0x0008739A )
#define ICU_IPR155_ADDR			( ( volatile uint8_t __evenaccess * )0x0008739B )
#define ICU_IPR156_ADDR			( ( volatile uint8_t __evenaccess * )0x0008739C )
#define ICU_IPR157_ADDR			( ( volatile uint8_t __evenaccess * )0x0008739D )
#define ICU_IPR158_ADDR			( ( volatile uint8_t __evenaccess * )0x0008739E )
#define ICU_IPR159_ADDR			( ( volatile uint8_t __evenaccess * )0x0008739F )
#define ICU_IPR160_ADDR			( ( volatile uint8_t __evenaccess * )0x000873A0 )
#define ICU_IPR161_ADDR			( ( volatile uint8_t __evenaccess * )0x000873A1 )
#define ICU_IPR162_ADDR			( ( volatile uint8_t __evenaccess * )0x000873A2 )
#define ICU_IPR163_ADDR			( ( volatile uint8_t __evenaccess * )0x000873A3 )
#define ICU_IPR164_ADDR			( ( volatile uint8_t __evenaccess * )0x000873A4 )
#define ICU_IPR165_ADDR			( ( volatile uint8_t __evenaccess * )0x000873A5 )
#define ICU_IPR166_ADDR			( ( volatile uint8_t __evenaccess * )0x000873A6 )
#define ICU_IPR167_ADDR			( ( volatile uint8_t __evenaccess * )0x000873A7 )
#define ICU_IPR168_ADDR			( ( volatile uint8_t __evenaccess * )0x000873A8 )
#define ICU_IPR169_ADDR			( ( volatile uint8_t __evenaccess * )0x000873A9 )
#define ICU_IPR170_ADDR			( ( volatile uint8_t __evenaccess * )0x000873AA )
#define ICU_IPR171_ADDR			( ( volatile uint8_t __evenaccess * )0x000873AB )
#define ICU_IPR172_ADDR			( ( volatile uint8_t __evenaccess * )0x000873AC )
#define ICU_IPR173_ADDR			( ( volatile uint8_t __evenaccess * )0x000873AD )
#define ICU_IPR174_ADDR			( ( volatile uint8_t __evenaccess * )0x000873AE )
#define ICU_IPR175_ADDR			( ( volatile uint8_t __evenaccess * )0x000873AF )
#define ICU_IPR176_ADDR			( ( volatile uint8_t __evenaccess * )0x000873B0 )
#define ICU_IPR177_ADDR			( ( volatile uint8_t __evenaccess * )0x000873B1 )
#define ICU_IPR178_ADDR			( ( volatile uint8_t __evenaccess * )0x000873B2 )
#define ICU_IPR179_ADDR			( ( volatile uint8_t __evenaccess * )0x000873B3 )
#define ICU_IPR180_ADDR			( ( volatile uint8_t __evenaccess * )0x000873B4 )
#define ICU_IPR181_ADDR			( ( volatile uint8_t __evenaccess * )0x000873B5 )
#define ICU_IPR182_ADDR			( ( volatile uint8_t __evenaccess * )0x000873B6 )
#define ICU_IPR183_ADDR			( ( volatile uint8_t __evenaccess * )0x000873B7 )
#define ICU_IPR184_ADDR			( ( volatile uint8_t __evenaccess * )0x000873B8 )
#define ICU_IPR185_ADDR			( ( volatile uint8_t __evenaccess * )0x000873B9 )
#define ICU_IPR186_ADDR			( ( volatile uint8_t __evenaccess * )0x000873BA )
#define ICU_IPR187_ADDR			( ( volatile uint8_t __evenaccess * )0x000873BB )
#define ICU_IPR188_ADDR			( ( volatile uint8_t __evenaccess * )0x000873BC )
#define ICU_IPR189_ADDR			( ( volatile uint8_t __evenaccess * )0x000873BD )
#define ICU_IPR190_ADDR			( ( volatile uint8_t __evenaccess * )0x000873BE )
#define ICU_IPR191_ADDR			( ( volatile uint8_t __evenaccess * )0x000873BF )
#define ICU_IPR192_ADDR			( ( volatile uint8_t __evenaccess * )0x000873C0 )
#define ICU_IPR193_ADDR			( ( volatile uint8_t __evenaccess * )0x000873C1 )
#define ICU_IPR194_ADDR			( ( volatile uint8_t __evenaccess * )0x000873C2 )
#define ICU_IPR195_ADDR			( ( volatile uint8_t __evenaccess * )0x000873C3 )
#define ICU_IPR196_ADDR			( ( volatile uint8_t __evenaccess * )0x000873C4 )
#define ICU_IPR197_ADDR			( ( volatile uint8_t __evenaccess * )0x000873C5 )
#define ICU_IPR198_ADDR			( ( volatile uint8_t __evenaccess * )0x000873C6 )
#define ICU_IPR199_ADDR			( ( volatile uint8_t __evenaccess * )0x000873C7 )
#define ICU_IPR200_ADDR			( ( volatile uint8_t __evenaccess * )0x000873C8 )
#define ICU_IPR201_ADDR			( ( volatile uint8_t __evenaccess * )0x000873C9 )
#define ICU_IPR202_ADDR			( ( volatile uint8_t __evenaccess * )0x000873CA )
#define ICU_IPR203_ADDR			( ( volatile uint8_t __evenaccess * )0x000873CB )
#define ICU_IPR204_ADDR			( ( volatile uint8_t __evenaccess * )0x000873CC )
#define ICU_IPR205_ADDR			( ( volatile uint8_t __evenaccess * )0x000873CD )
#define ICU_IPR206_ADDR			( ( volatile uint8_t __evenaccess * )0x000873CE )
#define ICU_IPR207_ADDR			( ( volatile uint8_t __evenaccess * )0x000873CF )
#define ICU_IPR208_ADDR			( ( volatile uint8_t __evenaccess * )0x000873D0 )
#define ICU_IPR209_ADDR			( ( volatile uint8_t __evenaccess * )0x000873D1 )
#define ICU_IPR210_ADDR			( ( volatile uint8_t __evenaccess * )0x000873D2 )
#define ICU_IPR211_ADDR			( ( volatile uint8_t __evenaccess * )0x000873D3 )
#define ICU_IPR212_ADDR			( ( volatile uint8_t __evenaccess * )0x000873D4 )
#define ICU_IPR213_ADDR			( ( volatile uint8_t __evenaccess * )0x000873D5 )
#define ICU_IPR214_ADDR			( ( volatile uint8_t __evenaccess * )0x000873D6 )
#define ICU_IPR215_ADDR			( ( volatile uint8_t __evenaccess * )0x000873D7 )
#define ICU_IPR216_ADDR			( ( volatile uint8_t __evenaccess * )0x000873D8 )
#define ICU_IPR217_ADDR			( ( volatile uint8_t __evenaccess * )0x000873D9 )
#define ICU_IPR218_ADDR			( ( volatile uint8_t __evenaccess * )0x000873DA )
#define ICU_IPR219_ADDR			( ( volatile uint8_t __evenaccess * )0x000873DB )
#define ICU_IPR220_ADDR			( ( volatile uint8_t __evenaccess * )0x000873DC )
#define ICU_IPR221_ADDR			( ( volatile uint8_t __evenaccess * )0x000873DD )
#define ICU_IPR222_ADDR			( ( volatile uint8_t __evenaccess * )0x000873DE )
#define ICU_IPR223_ADDR			( ( volatile uint8_t __evenaccess * )0x000873DF )
#define ICU_IPR224_ADDR			( ( volatile uint8_t __evenaccess * )0x000873E0 )
#define ICU_IPR225_ADDR			( ( volatile uint8_t __evenaccess * )0x000873E1 )
#define ICU_IPR226_ADDR			( ( volatile uint8_t __evenaccess * )0x000873E2 )
#define ICU_IPR227_ADDR			( ( volatile uint8_t __evenaccess * )0x000873E3 )
#define ICU_IPR228_ADDR			( ( volatile uint8_t __evenaccess * )0x000873E4 )
#define ICU_IPR229_ADDR			( ( volatile uint8_t __evenaccess * )0x000873E5 )
#define ICU_IPR230_ADDR			( ( volatile uint8_t __evenaccess * )0x000873E6 )
#define ICU_IPR231_ADDR			( ( volatile uint8_t __evenaccess * )0x000873E7 )
#define ICU_IPR232_ADDR			( ( volatile uint8_t __evenaccess * )0x000873E8 )
#define ICU_IPR233_ADDR			( ( volatile uint8_t __evenaccess * )0x000873E9 )
#define ICU_IPR234_ADDR			( ( volatile uint8_t __evenaccess * )0x000873EA )
#define ICU_IPR235_ADDR			( ( volatile uint8_t __evenaccess * )0x000873EB )
#define ICU_IPR236_ADDR			( ( volatile uint8_t __evenaccess * )0x000873EC )
#define ICU_IPR237_ADDR			( ( volatile uint8_t __evenaccess * )0x000873ED )
#define ICU_IPR238_ADDR			( ( volatile uint8_t __evenaccess * )0x000873EE )
#define ICU_IPR239_ADDR			( ( volatile uint8_t __evenaccess * )0x000873EF )
#define ICU_IPR240_ADDR			( ( volatile uint8_t __evenaccess * )0x000873F0 )
#define ICU_IPR241_ADDR			( ( volatile uint8_t __evenaccess * )0x000873F1 )
#define ICU_IPR242_ADDR			( ( volatile uint8_t __evenaccess * )0x000873F2 )
#define ICU_IPR243_ADDR			( ( volatile uint8_t __evenaccess * )0x000873F3 )
#define ICU_IPR244_ADDR			( ( volatile uint8_t __evenaccess * )0x000873F4 )
#define ICU_IPR245_ADDR			( ( volatile uint8_t __evenaccess * )0x000873F5 )
#define ICU_IPR246_ADDR			( ( volatile uint8_t __evenaccess * )0x000873F6 )
#define ICU_IPR247_ADDR			( ( volatile uint8_t __evenaccess * )0x000873F7 )
#define ICU_IPR248_ADDR			( ( volatile uint8_t __evenaccess * )0x000873F8 )
#define ICU_IPR249_ADDR			( ( volatile uint8_t __evenaccess * )0x000873F9 )
#define ICU_IPR250_ADDR			( ( volatile uint8_t __evenaccess * )0x000873FA )
#define ICU_IPR251_ADDR			( ( volatile uint8_t __evenaccess * )0x000873FB )
#define ICU_IPR252_ADDR			( ( volatile uint8_t __evenaccess * )0x000873FC )
#define ICU_IPR253_ADDR			( ( volatile uint8_t __evenaccess * )0x000873FD )
#define ICU_IPR254_ADDR			( ( volatile uint8_t __evenaccess * )0x000873FE )
#define ICU_IPR255_ADDR			( ( volatile uint8_t __evenaccess * )0x000873FF )
#define ICU_IPR_OFFSET			( 0U )
#define ICU_IPR_MASK			( 0xFU << ICU_IPR_OFFSET )

