h7ga40/azure_iot_hub/asp3_dcre/arch/rx630_gcc/rx630.h
/*
 *  I/Oポートのレジスタ及び設定ビット情報
 */
#define PORT0_PDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C000 )
#define PORT1_PDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C001 )
#define PORT2_PDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C002 )
#define PORT3_PDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C003 )
#define PORT4_PDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C004 )
#define PORT5_PDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C005 )
#define PORT6_PDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C006 )
#define PORT7_PDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C007 )
#define PORT8_PDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C008 )
#define PORT9_PDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C009 )
#define PORTA_PDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C00A )
#define PORTB_PDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C00B )
#define PORTC_PDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C00C )
#define PORTD_PDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C00D )
#define PORTE_PDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C00E )
#define PORTF_PDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C00F )
#define PORTG_PDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C010 )
#define PORTJ_PDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C012 )
#define PORT_PDR_B0_BIT			( 0x01U << 0U )
#define PORT_PDR_B1_BIT			( 0x01U << 1U )
#define PORT_PDR_B2_BIT			( 0x01U << 2U )
#define PORT_PDR_B3_BIT			( 0x01U << 3U )
#define PORT_PDR_B4_BIT			( 0x01U << 4U )
#define PORT_PDR_B5_BIT			( 0x01U << 5U )
#define PORT_PDR_B6_BIT			( 0x01U << 6U )
#define PORT_PDR_B7_BIT			( 0x01U << 7U )
#define PORT0_PODR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C020 )
#define PORT1_PODR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C021 )
#define PORT2_PODR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C022 )
#define PORT3_PODR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C023 )
#define PORT4_PODR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C024 )
#define PORT5_PODR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C025 )
#define PORT6_PODR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C026 )
#define PORT7_PODR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C027 )
#define PORT8_PODR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C028 )
#define PORT9_PODR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C029 )
#define PORTA_PODR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C02A )
#define PORTB_PODR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C02B )
#define PORTC_PODR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C02C )
#define PORTD_PODR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C02D )
#define PORTE_PODR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C02E )
#define PORTF_PODR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C02F )
#define PORTG_PODR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C030 )
#define PORTJ_PODR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C032 )
#define PORT_PODR_B0_BIT		( 0x01U << 0U )
#define PORT_PODR_B1_BIT		( 0x01U << 1U )
#define PORT_PODR_B2_BIT		( 0x01U << 2U )
#define PORT_PODR_B3_BIT		( 0x01U << 3U )
#define PORT_PODR_B4_BIT		( 0x01U << 4U )
#define PORT_PODR_B5_BIT		( 0x01U << 5U )
#define PORT_PODR_B6_BIT		( 0x01U << 6U )
#define PORT_PODR_B7_BIT		( 0x01U << 7U )
#define PORT0_PIDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C040 )
#define PORT1_PIDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C041 )
#define PORT2_PIDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C042 )
#define PORT3_PIDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C043 )
#define PORT4_PIDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C044 )
#define PORT5_PIDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C045 )
#define PORT6_PIDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C046 )
#define PORT7_PIDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C047 )
#define PORT8_PIDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C048 )
#define PORT9_PIDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C049 )
#define PORTA_PIDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C04A )
#define PORTB_PIDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C04B )
#define PORTC_PIDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C04C )
#define PORTD_PIDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C04D )
#define PORTE_PIDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C04E )
#define PORTF_PIDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C04F )
#define PORTG_PIDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C050 )
#define PORTJ_PIDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C052 )
#define PORT_PIDR_B0_BIT		( 0x01U << 0U )
#define PORT_PIDR_B1_BIT		( 0x01U << 1U )
#define PORT_PIDR_B2_BIT		( 0x01U << 2U )
#define PORT_PIDR_B3_BIT		( 0x01U << 3U )
#define PORT_PIDR_B4_BIT		( 0x01U << 4U )
#define PORT_PIDR_B5_BIT		( 0x01U << 5U )
#define PORT_PIDR_B6_BIT		( 0x01U << 6U )
#define PORT_PIDR_B7_BIT		( 0x01U << 7U )
#define PORT0_PMR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C060 )
#define PORT1_PMR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C061 )
#define PORT2_PMR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C062 )
#define PORT3_PMR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C063 )
#define PORT4_PMR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C064 )
#define PORT5_PMR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C065 )
#define PORT6_PMR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C066 )
#define PORT7_PMR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C067 )
#define PORT8_PMR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C068 )
#define PORT9_PMR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C069 )
#define PORTA_PMR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C06A )
#define PORTB_PMR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C06B )
#define PORTC_PMR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C06C )
#define PORTD_PMR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C06D )
#define PORTE_PMR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C06E )
#define PORTF_PMR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C06F )
#define PORTG_PMR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C070 )
#define PORTJ_PMR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C072 )
#define PORT_PMR_B0_BIT			( 0x01U << 0U )
#define PORT_PMR_B1_BIT			( 0x01U << 1U )
#define PORT_PMR_B2_BIT			( 0x01U << 2U )
#define PORT_PMR_B3_BIT			( 0x01U << 3U )
#define PORT_PMR_B4_BIT			( 0x01U << 4U )
#define PORT_PMR_B5_BIT			( 0x01U << 5U )
#define PORT_PMR_B6_BIT			( 0x01U << 6U )
#define PORT_PMR_B7_BIT			( 0x01U << 7U )
#define PORT0_PCR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C0C0 )
#define PORT1_PCR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C0C1 )
#define PORT2_PCR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C0C2 )
#define PORT3_PCR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C0C3 )
#define PORT4_PCR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C0C4 )
#define PORT5_PCR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C0C5 )
#define PORT6_PCR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C0C6 )
#define PORT7_PCR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C0C7 )
#define PORT8_PCR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C0C8 )
#define PORT9_PCR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C0C9 )
#define PORTA_PCR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C0CA )
#define PORTB_PCR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C0CB )
#define PORTC_PCR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C0CC )
#define PORTD_PCR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C0CD )
#define PORTE_PCR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C0CE )
#define PORTF_PCR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C0CF )
#define PORTG_PCR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C0D0 )
#define PORTJ_PCR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C0D2 )
#define PORT_PCR_B0_BIT			( 0x01U << 0U )
#define PORT_PCR_B1_BIT			( 0x01U << 1U )
#define PORT_PCR_B2_BIT			( 0x01U << 2U )
#define PORT_PCR_B3_BIT			( 0x01U << 3U )
#define PORT_PCR_B4_BIT			( 0x01U << 4U )
#define PORT_PCR_B5_BIT			( 0x01U << 5U )
#define PORT_PCR_B6_BIT			( 0x01U << 6U )
#define PORT_PCR_B7_BIT			( 0x01U << 7U )
#define PORT0_ODR0_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C080 )
#define PORT1_ODR0_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C082 )
#define PORT2_ODR0_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C084 )
#define PORT3_ODR0_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C086 )
#define PORT4_ODR0_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C088 )
#define PORT5_ODR0_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C08A )
#define PORT6_ODR0_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C08C )
#define PORT7_ODR0_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C08E )
#define PORT8_ODR0_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C090 )
#define PORT9_ODR0_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C092 )
#define PORTA_ODR0_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C094 )
#define PORTB_ODR0_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C096 )
#define PORTC_ODR0_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C098 )
#define PORTD_ODR0_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C09A )
#define PORTE_ODR0_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C09C )
#define PORTF_ODR0_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C09E )
#define PORTG_ODR0_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C0A0 )
#define PORTJ_ODR0_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C0A4 )
#define PORT0_ODR1_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C081 )
#define PORT1_ODR1_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C083 )
#define PORT2_ODR1_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C085 )
#define PORT3_ODR1_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C087 )
#define PORT4_ODR1_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C089 )
#define PORT5_ODR1_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C08B )
#define PORT6_ODR1_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C08D )
#define PORT7_ODR1_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C08F )
#define PORT8_ODR1_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C091 )
#define PORT9_ODR1_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C093 )
#define PORTA_ODR1_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C095 )
#define PORTB_ODR1_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C097 )
#define PORTC_ODR1_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C099 )
#define PORTD_ODR1_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C09B )
#define PORTE_ODR1_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C09D )
#define PORTF_ODR1_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C09F )
#define PORTG_ODR1_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C0A1 )
#define PORTJ_ODR1_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C0A5 )
#define PORT_ODR_Pm0_OFFSET		( 0U )
#define PORT_ODR_Pm0_MASK		( 0x3U << PORT_ODR_Pm0_OFFSET )
#define PORT_ODR_Pm1_OFFSET		( 2U )
#define PORT_ODR_Pm1_MASK		( 0x3U << PORT_ODR_Pm1_OFFSET )
#define PORT_ODR_Pm2_OFFSET		( 4U )
#define PORT_ODR_Pm2_MASK		( 0x3U << PORT_ODR_Pm2_OFFSET )
#define PORT_ODR_Pm3_OFFSET		( 6U )
#define PORT_ODR_Pm3_MASK		( 0x3U << PORT_ODR_Pm3_OFFSET )
#define PORT_ODR_Pm4_OFFSET		( 0U )
#define PORT_ODR_Pm4_MASK		( 0x3U << PORT_ODR_Pm4_OFFSET )
#define PORT_ODR_Pm5_OFFSET		( 2U )
#define PORT_ODR_Pm5_MASK		( 0x3U << PORT_ODR_Pm5_OFFSET )
#define PORT_ODR_Pm6_OFFSET		( 4U )
#define PORT_ODR_Pm6_MASK		( 0x3U << PORT_ODR_Pm6_OFFSET )
#define PORT_ODR_Pm7_OFFSET		( 6U )
#define PORT_ODR_Pm7_MASK		( 0x3U << PORT_ODR_Pm7_OFFSET )
#define PORT_ODR_CMOS			( 0U )
#define PORT_ODR_NCH_OPEN_DRAIN	( 1U )
#define PORT_ODR_PCH_OPEN_DRAIN	( 2U )

