h7ga40/azure_iot_hub/asp3_dcre/arch/rx630_gcc/rx630.h
/*
 * リアルタイムクロック
 */
#define RTC_R64CNT_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C400 )
#define RTC_RSECCNT_ADDR		( ( volatile uint8_t __evenaccess * )0x0008C402 )
#define RTC_RMINCNT_ADDR		( ( volatile uint8_t __evenaccess * )0x0008C404 )
#define RTC_RHRCNT_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C406 )
#define RTC_RWKCNT_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C408 )
#define RTC_RDAYCNT_ADDR		( ( volatile uint8_t __evenaccess * )0x0008C40A )
#define RTC_RMONCNT_ADDR		( ( volatile uint8_t __evenaccess * )0x0008C40C )
#define RTC_RYRCNT_ADDR			( ( volatile uint8_t __evenaccess * )0x0008C40E )

/*
 * 12 ビットA/D コンバータ
 */
#define S12AD_ADCSR_ADDR		( ( volatile uint8_t __evenaccess * )0x00089000 )
#define S12AD_ADCSR_ADST_BIT	0x80
#define S12AD_ADANS0_ADDR		( ( volatile uint16_t __evenaccess * )0x00089004 )
#define S12AD_ADANS1_ADDR		( ( volatile uint16_t __evenaccess * )0x00089006 )
#define S12AD_ADEXICR_ADDR		( ( volatile uint16_t __evenaccess * )0x00089012 )
#define S12AD_ADDR0_ADDR		( ( volatile uint16_t __evenaccess * )0x00089020 )
#define S12AD_ADDR1_ADDR		( ( volatile uint16_t __evenaccess * )0x00089022 )
#define S12AD_ADDR2_ADDR		( ( volatile uint16_t __evenaccess * )0x00089024 )
#define S12AD_ADDR3_ADDR		( ( volatile uint16_t __evenaccess * )0x00089026 )
#define S12AD_ADDR4_ADDR		( ( volatile uint16_t __evenaccess * )0x00089028 )
#define S12AD_ADDR5_ADDR		( ( volatile uint16_t __evenaccess * )0x0008902A )
#define S12AD_ADDR6_ADDR		( ( volatile uint16_t __evenaccess * )0x0008902C )
#define S12AD_ADDR7_ADDR		( ( volatile uint16_t __evenaccess * )0x0008902E )
#define S12AD_ADDR8_ADDR		( ( volatile uint16_t __evenaccess * )0x00089030 )
#define S12AD_ADDR9_ADDR		( ( volatile uint16_t __evenaccess * )0x00089032 )
#define S12AD_ADDR10_ADDR		( ( volatile uint16_t __evenaccess * )0x00089034 )
#define S12AD_ADDR11_ADDR		( ( volatile uint16_t __evenaccess * )0x00089036 )
#define S12AD_ADDR12_ADDR		( ( volatile uint16_t __evenaccess * )0x00089038 )
#define S12AD_ADDR13_ADDR		( ( volatile uint16_t __evenaccess * )0x0008903A )
#define S12AD_ADDR14_ADDR		( ( volatile uint16_t __evenaccess * )0x0008903C )
#define S12AD_ADDR15_ADDR		( ( volatile uint16_t __evenaccess * )0x0008903E )
#define S12AD_ADDR16_ADDR		( ( volatile uint16_t __evenaccess * )0x00089040 )
#define S12AD_ADDR17_ADDR		( ( volatile uint16_t __evenaccess * )0x00089042 )
#define S12AD_ADDR18_ADDR		( ( volatile uint16_t __evenaccess * )0x00089044 )
#define S12AD_ADDR19_ADDR		( ( volatile uint16_t __evenaccess * )0x00089046 )
#define S12AD_ADDR20_ADDR		( ( volatile uint16_t __evenaccess * )0x00089048 )

#define TPU0_TCR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088110 )
#define TPU1_TCR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088120 )
#define TPU2_TCR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088130 )
#define TPU3_TCR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088140 )
#define TPU4_TCR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088150 )
#define TPU5_TCR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088160 )
#define TPU6_TCR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088180 )
#define TPU7_TCR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088190 )
#define TPU8_TCR_ADDR			( ( volatile uint8_t __evenaccess * )0x000881A0 )
#define TPU9_TCR_ADDR			( ( volatile uint8_t __evenaccess * )0x000881B0 )
#define TPU10_TCR_ADDR			( ( volatile uint8_t __evenaccess * )0x000881C0 )
#define TPU11_TCR_ADDR			( ( volatile uint8_t __evenaccess * )0x000881D0 )
#define TPU_TCR_TPSC_OFFSET		( 0U )
#define TPU_TCR_TPSC_MASK		( 0x7U << TPU_TCR_TPSC_OFFSET )
#define TPU_TCR_CKEG_OFFSET		( 3U )
#define TPU_TCR_CKEG_MASK		( 0x3U << TPU_TCR_CKEG_OFFSET )
#define TPU_TCR_CCLR_OFFSET		( 5U )
#define TPU_TCR_CCLR_MASK		( 0x7U << TPU_TCR_CCLR_OFFSET )

#define TPU0_TMDR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088111 )
#define TPU1_TMDR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088121 )
#define TPU2_TMDR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088131 )
#define TPU3_TMDR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088141 )
#define TPU4_TMDR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088151 )
#define TPU5_TMDR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088161 )
#define TPU6_TMDR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088181 )
#define TPU7_TMDR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088191 )
#define TPU8_TMDR_ADDR			( ( volatile uint8_t __evenaccess * )0x000881A1 )
#define TPU9_TMDR_ADDR			( ( volatile uint8_t __evenaccess * )0x000881B1 )
#define TPU10_TMDR_ADDR			( ( volatile uint8_t __evenaccess * )0x000881C1 )
#define TPU11_TMDR_ADDR			( ( volatile uint8_t __evenaccess * )0x000881D1 )
#define TPU_TMDR_MD_OFFSET		( 0U )
#define TPU_TMDR_MD_MASK		( 0xFU << TPU_TMDR_MD_OFFSET )
#define TPU_TMDR_BFA_BIT		( 0x10 )
#define TPU_TMDR_BFB_BIT		( 0x20 )
#define TPU_TMDR_ICSELB_BIT		( 0x40 )
#define TPU_TMDR_ICSELD_BIT		( 0x80 )

#define TPU0_TIOR_ADDR			( ( volatile uint8_t __evenaccess * )0x000881C0 )
#define TPU0_TIORH_ADDR			( ( volatile uint8_t __evenaccess * )0x00088112 )
#define TPU0_TIORL_ADDR			( ( volatile uint8_t __evenaccess * )0x00088113 )
#define TPU1_TIOR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088122 )
#define TPU2_TIOR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088132 )
#define TPU3_TIORH_ADDR			( ( volatile uint8_t __evenaccess * )0x00088142 )
#define TPU3_TIORL_ADDR			( ( volatile uint8_t __evenaccess * )0x00088143 )
#define TPU4_TIOR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088152 )
#define TPU5_TIOR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088162 )
#define TPU6_TIORH_ADDR			( ( volatile uint8_t __evenaccess * )0x00088182 )
#define TPU6_TIORL_ADDR			( ( volatile uint8_t __evenaccess * )0x00088183 )
#define TPU7_TIOR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088192 )
#define TPU8_TIOR_ADDR			( ( volatile uint8_t __evenaccess * )0x000881A2 )
#define TPU9_TIORH_ADDR			( ( volatile uint8_t __evenaccess * )0x000881B2 )
#define TPU9_TIORL_ADDR			( ( volatile uint8_t __evenaccess * )0x000881B3 )
#define TPU10_TIOR_ADDR			( ( volatile uint8_t __evenaccess * )0x000881C2 )
#define TPU11_TIOR_ADDR			( ( volatile uint8_t __evenaccess * )0x000881D2 )
#define TPU_TIOR_IOA_OFFSET	( 0U )
#define TPU_TIOR_IOA_MASK		( 0xFU << TPU_TIOR_IOA_OFFSET )
#define TPU_TIOR_IOB_OFFSET	( 4U )
#define TPU_TIOR_IOB_MASK		( 0xFU << TPU_TIOR_IOB_OFFSET )
#define TPU_TIORH_IOA_OFFSET	( 0U )
#define TPU_TIORH_IOA_MASK		( 0xFU << TPU_TIORH_IOA_OFFSET )
#define TPU_TIORH_IOB_OFFSET	( 4U )
#define TPU_TIORH_IOB_MASK		( 0xFU << TPU_TIORH_IOB_OFFSET )
#define TPU_TIORL_IOC_OFFSET	( 0U )
#define TPU_TIORL_IOC_MASK		( 0xFU << TPU_TIORL_IOC_OFFSET )
#define TPU_TIORL_IOD_OFFSET	( 4U )
#define TPU_TIORL_IOD_MASK		( 0xFU << TPU_TIORL_IOD_OFFSET )

