h7ga40/azure_iot_hub/asp3_dcre/arch/rx630_gcc/rx630.h
#define TPU0_TGRA_ADDR			( ( volatile uint16_t __evenaccess * )0x00088118 )
#define TPU0_TGRB_ADDR			( ( volatile uint16_t __evenaccess * )0x0008811A )
#define TPU0_TGRC_ADDR			( ( volatile uint16_t __evenaccess * )0x0008811C )
#define TPU0_TGRD_ADDR			( ( volatile uint16_t __evenaccess * )0x0008811E )
#define TPU1_TGRA_ADDR			( ( volatile uint16_t __evenaccess * )0x00088128 )
#define TPU1_TGRB_ADDR			( ( volatile uint16_t __evenaccess * )0x0008812A )
#define TPU2_TGRA_ADDR			( ( volatile uint16_t __evenaccess * )0x00088138 )
#define TPU2_TGRB_ADDR			( ( volatile uint16_t __evenaccess * )0x0008813A )
#define TPU3_TGRA_ADDR			( ( volatile uint16_t __evenaccess * )0x00088148 )
#define TPU3_TGRB_ADDR			( ( volatile uint16_t __evenaccess * )0x0008814A )
#define TPU3_TGRC_ADDR			( ( volatile uint16_t __evenaccess * )0x0008814C )
#define TPU3_TGRD_ADDR			( ( volatile uint16_t __evenaccess * )0x0008814E )
#define TPU4_TGRA_ADDR			( ( volatile uint16_t __evenaccess * )0x00088158 )
#define TPU4_TGRB_ADDR			( ( volatile uint16_t __evenaccess * )0x0008815A )
#define TPU5_TGRA_ADDR			( ( volatile uint16_t __evenaccess * )0x00088168 )
#define TPU5_TGRB_ADDR			( ( volatile uint16_t __evenaccess * )0x0008816A )
#define TPU6_TGRA_ADDR			( ( volatile uint16_t __evenaccess * )0x00088188 )
#define TPU6_TGRB_ADDR			( ( volatile uint16_t __evenaccess * )0x0008818A )
#define TPU6_TGRC_ADDR			( ( volatile uint16_t __evenaccess * )0x0008818C )
#define TPU6_TGRD_ADDR			( ( volatile uint16_t __evenaccess * )0x0008818E )
#define TPU7_TGRA_ADDR			( ( volatile uint16_t __evenaccess * )0x00088198 )
#define TPU7_TGRB_ADDR			( ( volatile uint16_t __evenaccess * )0x0008819A )
#define TPU8_TGRA_ADDR			( ( volatile uint16_t __evenaccess * )0x000881A8 )
#define TPU8_TGRB_ADDR			( ( volatile uint16_t __evenaccess * )0x000881AA )
#define TPU9_TGRA_ADDR			( ( volatile uint16_t __evenaccess * )0x000881B8 )
#define TPU9_TGRB_ADDR			( ( volatile uint16_t __evenaccess * )0x000881BA )
#define TPU9_TGRC_ADDR			( ( volatile uint16_t __evenaccess * )0x000881BC )
#define TPU9_TGRD_ADDR			( ( volatile uint16_t __evenaccess * )0x000881BE )
#define TPU10_TGRA_ADDR			( ( volatile uint16_t __evenaccess * )0x000881C8 )
#define TPU10_TGRB_ADDR			( ( volatile uint16_t __evenaccess * )0x000881CA )
#define TPU11_TGRA_ADDR			( ( volatile uint16_t __evenaccess * )0x000881D8 )
#define TPU11_TGRB_ADDR			( ( volatile uint16_t __evenaccess * )0x000881DA )

#define TPUA_TSTR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088100 )
#define TPUB_TSTR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088170 )
#define TPU_TSTR_CST0_BIT		( 0x01U << 0U )
#define TPU_TSTR_CST1_BIT		( 0x01U << 1U )
#define TPU_TSTR_CST2_BIT		( 0x01U << 2U )
#define TPU_TSTR_CST3_BIT		( 0x01U << 3U )
#define TPU_TSTR_CST4_BIT		( 0x01U << 4U )
#define TPU_TSTR_CST5_BIT		( 0x01U << 5U )

#define TPUA_TSYR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088101 )
#define TPUB_TSYR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088171 )
#define TPU_TSYR_SYNC0_BIT		( 0x01U << 0U )
#define TPU_TSYR_SYNC1_BIT		( 0x01U << 1U )
#define TPU_TSYR_SYNC2_BIT		( 0x01U << 2U )
#define TPU_TSYR_SYNC3_BIT		( 0x01U << 3U )
#define TPU_TSYR_SYNC4_BIT		( 0x01U << 4U )
#define TPU_TSYR_SYNC5_BIT		( 0x01U << 5U )

#define TPU0_TIER_ADDR			( ( volatile uint8_t __evenaccess *)0x00088114 )
#define TPU1_TIER_ADDR			( ( volatile uint8_t __evenaccess *)0x00088124 )
#define TPU2_TIER_ADDR			( ( volatile uint8_t __evenaccess *)0x00088134 )
#define TPU3_TIER_ADDR			( ( volatile uint8_t __evenaccess *)0x00088144 )
#define TPU4_TIER_ADDR			( ( volatile uint8_t __evenaccess *)0x00088154 )
#define TPU5_TIER_ADDR			( ( volatile uint8_t __evenaccess *)0x00088164 )
#define TPU6_TIER_ADDR			( ( volatile uint8_t __evenaccess *)0x00088184 )
#define TPU7_TIER_ADDR			( ( volatile uint8_t __evenaccess *)0x00088194 )
#define TPU8_TIER_ADDR			( ( volatile uint8_t __evenaccess *)0x000881A4 )
#define TPU9_TIER_ADDR			( ( volatile uint8_t __evenaccess *)0x000881B4 )
#define TPU10_TIER_ADDR			( ( volatile uint8_t __evenaccess *)0x000881C4 )
#define TPU11_TIER_ADDR			( ( volatile uint8_t __evenaccess *)0x000881D4 )

#define TPU0_TCNT_ADDR			( ( volatile uint16_t __evenaccess *)0x00088116 )
#define TPU1_TCNT_ADDR			( ( volatile uint16_t __evenaccess *)0x00088126 )
#define TPU2_TCNT_ADDR			( ( volatile uint16_t __evenaccess *)0x00088136 )
#define TPU3_TCNT_ADDR			( ( volatile uint16_t __evenaccess *)0x00088146 )
#define TPU4_TCNT_ADDR			( ( volatile uint16_t __evenaccess *)0x00088156 )
#define TPU5_TCNT_ADDR			( ( volatile uint16_t __evenaccess *)0x00088166 )
#define TPU6_TCNT_ADDR			( ( volatile uint16_t __evenaccess *)0x00088186 )
#define TPU7_TCNT_ADDR			( ( volatile uint16_t __evenaccess *)0x00088196 )
#define TPU8_TCNT_ADDR			( ( volatile uint16_t __evenaccess *)0x000881A6 )
#define TPU9_TCNT_ADDR			( ( volatile uint16_t __evenaccess *)0x000881B6 )
#define TPU10_TCNT_ADDR			( ( volatile uint16_t __evenaccess *)0x000881C6 )
#define TPU11_TCNT_ADDR			( ( volatile uint16_t __evenaccess *)0x000881D6 )

/*
 * RSPI
 */
#define RSPI0_SPCR_ADDR		( ( volatile uint8_t __evenaccess * )0x00088380 )
#define RSPI1_SPCR_ADDR		( ( volatile uint8_t __evenaccess * )0x000883A0 )
#define RSPI2_SPCR_ADDR		( ( volatile uint8_t __evenaccess * )0x000883C0 )
#define RSPI_SPCR_SPMS_BIT	( 0x01U << 0U )
#define RSPI_SPCR_TXMD_BIT	( 0x01U << 1U )
#define RSPI_SPCR_MODFEN_BIT	( 0x01U << 2U )
#define RSPI_SPCR_MSTR_BIT	( 0x01U << 3U )
#define RSPI_SPCR_SPEIE_BIT	( 0x01U << 4U )
#define RSPI_SPCR_SPTIE_BIT	( 0x01U << 5U )
#define RSPI_SPCR_SPE_BIT	( 0x01U << 6U )
#define RSPI_SPCR_SPRIE_BIT	( 0x01U << 7U )

#define RSPI0_SSLP_ADDR		( ( volatile uint8_t __evenaccess * )0x00088381 )
#define RSPI1_SSLP_ADDR		( ( volatile uint8_t __evenaccess * )0x000883A1 )
#define RSPI2_SSLP_ADDR		( ( volatile uint8_t __evenaccess * )0x000883C1 )

#define RSPI0_SPPCR_ADDR	( ( volatile uint8_t __evenaccess * )0x00088382 )
#define RSPI1_SPPCR_ADDR	( ( volatile uint8_t __evenaccess * )0x000883A2 )
#define RSPI2_SPPCR_ADDR	( ( volatile uint8_t __evenaccess * )0x000883C2 )

#define RSPI0_SPSR_ADDR		( ( volatile uint8_t __evenaccess * )0x00088383 )
#define RSPI1_SPSR_ADDR		( ( volatile uint8_t __evenaccess * )0x000883A3 )
#define RSPI2_SPSR_ADDR		( ( volatile uint8_t __evenaccess * )0x000883C3 )

#define RSPI0_SPDR_ADDR		( ( volatile uint32_t __evenaccess * )0x00088384 )
#define RSPI1_SPDR_ADDR		( ( volatile uint32_t __evenaccess * )0x000883A4 )
#define RSPI2_SPDR_ADDR		( ( volatile uint32_t __evenaccess * )0x000883C4 )

#define RSPI0_SPSCR_ADDR	( ( volatile uint8_t __evenaccess * )0x00088388 )
#define RSPI1_SPSCR_ADDR	( ( volatile uint8_t __evenaccess * )0x000883A8 )
#define RSPI2_SPSCR_ADDR	( ( volatile uint8_t __evenaccess * )0x000883C8 )

#define RSPI0_SPSSR_ADDR	( ( volatile uint8_t __evenaccess * )0x00088389 )
#define RSPI1_SPSSR_ADDR	( ( volatile uint8_t __evenaccess * )0x000883A9 )
#define RSPI2_SPSSR_ADDR	( ( volatile uint8_t __evenaccess * )0x000883C9 )

#define RSPI0_SPBR_ADDR		( ( volatile uint8_t __evenaccess * )0x0008838A )
#define RSPI1_SPBR_ADDR		( ( volatile uint8_t __evenaccess * )0x000883AA )
#define RSPI2_SPBR_ADDR		( ( volatile uint8_t __evenaccess * )0x000883CA )

#define RSPI0_SPDCR_ADDR	( ( volatile uint8_t __evenaccess * )0x0008838B )
#define RSPI1_SPDCR_ADDR	( ( volatile uint8_t __evenaccess * )0x000883AB )
#define RSPI2_SPDCR_ADDR	( ( volatile uint8_t __evenaccess * )0x000883CB )

#define RSPI0_SPCKD_ADDR	( ( volatile uint8_t __evenaccess * )0x0008838C )
#define RSPI1_SPCKD_ADDR	( ( volatile uint8_t __evenaccess * )0x000883AC )
#define RSPI2_SPCKD_ADDR	( ( volatile uint8_t __evenaccess * )0x000883CC )

